{"timeout": "3600000",
  "items": [{"event_id": 104,
      
      "start_time": "2013-06-18T08:00:00-07:00",
      "event_title": "Registration Opens",
      "end_time": "2013-06-18T08:00:00-07:00",
      "description": "",
      "room_title": null
    }, {"event_title": "Morning Keynote: James Vasile",
      "event_id": 1165,
     
      "start_time": "2013-06-18T09:00:00-07:00",
      "end_time": "2013-06-18T09:45:00-07:00",
      "description": " Open source communities.",
      "room_title": "Sanctuary",
      "track_id": 29,
      "speaker_ids": [
        1312
      ],
      "presenter": null}, {"room_title": null,
            "end_time": "2013-06-18T10:00:00-07:00",   "event_title": "Coffee Break", "updated_at": "2013-04-07T16:59:18-07:00",  "event_id": 105, "description": "", "start_time": "2013-06-18T09:45:00-07:00"}, {"room_title": "B302/303",
      "end_time": "2013-06-18T10:45:00-07:00",     "event_title": "Kicking Impostor Syndrome In The Head",
      "speaker_ids": [1287], "event_id": 967,
      "track_id": 29,
      "description": "Impostor syndrome is the persistent internalized belief that no matter what your accomplishments might be, they don’t count enough to qualify you as a “real” [insert noun here], plus the corresponding fear that any minute, everybody’s going to figure out you’re totally faking it. It’s one of the leading reasons why users of open source software don’t become developers of open source software, and why many developers of open source software don’t step out of their comfort zone to try new things. (Plus, it makes you feel awful.)\r\n\r\nIn this session, we’ll address impostor syndrome from both a personal viewpoint -- how you can help combat those feelings in yourself -- and an affirmational viewpoint -- how you can help others overcome their own impostor syndrome. We’ll also discuss ways open source contributors and projects can specifically fight impostor syndrome among their community contributors (and among people who would be contributors if they believed they were qualified enough to be). You’ll leave with a whole host of tips, tricks, and \"mind hacks\" to help get over the nagging fear somebody’s going to discover any minute that you’re a great big fraud.",
      "start_time": "2013-06-18T10:00:00-07:00",
      "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-18T10:45:00-07:00",     "event_title": "How Good is My Business Idea? Strategic Analysis for Techies",
      "speaker_ids": [1341], "event_id": 1035,
      "track_id": 26,
      "description": "There was a time where I talked to 5 people a month who wanted to hire me to build the Facebook for &lt;insert vertical here&gt;. Not surprisingly, none of them succeeded. At the same time, I've been running a successful business for the past 7 years.\r\n\r\nIn this talk, we will use the basics of business strategy to talk about the kinds of businesses that succeed and why. We will focus on businesses that use OSS and the types of businesses those in the community are most likely to start.",
      "start_time": "2013-06-18T10:00:00-07:00",
      "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-18T10:00:00-07:00",     "event_title": "Custom Markup for Working and Writing",
      "speaker_ids": [336], "event_id": 1080,
      "track_id": 30,
      "description": "We've moved sharing to the client-side to make a federation of wiki sites feel like one. This leaves the server free to take on more responsibility for the work we do. In this talk I will show several custom markups that make it possible to do server-side work from a client-side wiki. I'll also dissect a page or two of code implementing a custom markup interpreter and explain how these implementations have influenced the design of my new wiki.",
      "start_time": "2013-06-18T10:00:00-07:00",
      "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-18T10:45:00-07:00",     "event_title": "Switching Teams: Moving an Application from MySQL to PostgreSQL",
      "speaker_ids": [1279], "event_id": 988,
      "track_id": 30,
      "description": "SQL is an ISO standard, so you should just be able to switch backend databases, right? Sadly, while standards help, real life applications almost always use version specific syntax and functions. Five years into the development of our application, we started thinking that a different database backend would better meet our future needs. This is the story of why we choose Postgres and Open Source, how and why we switched, what worked, what didn't, what was easy and what was hard. The conversion of our user generated data from a mixture of unknown and unrecorded character sets to consistent UTF-8 added some interesting twists to our journey.\r\n\r\nWhile each application is different, Julie will give you the information you need to decide whether switching backends is right for your project and some tools to get you started. Although we switched from MySQL to PostgreSQL, most of the information applies to any SQL database. This talk will also be useful to people who have been thinking about switching backends for future projects or working on a project with an unfamiliar SQL dialect.\r\n\r\nFor those who are interested, the application in question provide the CATME SMARTER Teamwork tools (http://www.catme.org) A demo is available at https://www.catme.org/login/survey_instructions",
      "start_time": "2013-06-18T10:00:00-07:00",
      "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-18T10:45:00-07:00",    "event_title": "Study Design: the best model for a cat is... a cat!",
      "speaker_ids": [1215], "event_id": 1127,
      "track_id": 27,
      "description": "Good study design is like test driven development. In TDD you write the tests before development. In study design you clarify and define the problem or question you want answered before you start collecting data. Pilot studies are performed to see if your idea is workable, or if you need to make adjustments, just like we test code to see if it breaks on Y2K. \r\n\r\nData is everywhere and easily collected. This talk will cover the fundamental statistical principles that allow you answer questions and make predictions.  We’ll talk about barriers to effective experimentation, like poorly defined logic. (I was once asked to study a medical  problem where the definition was “I know it when I see it.\") We’ll also look at some basic R code for frequencies, distributions and histograms to help you analyze your data once you’ve collected it.\r\n\r\nHere’s why this is important to me. At times I have given up and pulled my hair out over bad, insufficient study designs. Good planning up front would saved my clients so much money. I have done many research studies. I had to defend studies when the conclusions conflict with conventional wisdom. Solid study design has backed me up, and it will do the same for you.\r\n",
      "start_time": "2013-06-18T10:00:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T10:45:00-07:00",    "event_title": "Taming Your Inner Cowboy Coder - A Simple And Sane DevOps Workflow",
      "speaker_ids": [88, 1309], "event_id": 995,
      "track_id": 28,
      "description": "UPDATE: Here are some links. \r\nGithub: https://github.com/gchaix/webdev-vagrant\r\n\r\nMoving sites from your development environment to a staging or production server can be time-consuming and challenging. This session will provide you with easy-to-use tools and workflow to bridge the gap between development and operations.\r\n\r\nVagrant and VirtualBox: Spin up pre-configured virtual servers on your workstation, saving the hassle of either a local AMP stack or a remote development server. Use your preferred development tools alongside a production-ready server environment.  \r\nPuppet: Automatically configure the virtual environment on your workstation and keep it in sync with your staging and production server configuration. \r\nGit: Use lightweight version control to help you safely and easily move code from development to production with a minimum of fuss.\r\n\r\nAt the end of the session, attendees will have a basic repository containing both project code as well as the virtualization and configuration scripts ready to be be used as a template for their next project.",
      "start_time": "2013-06-18T10:00:00-07:00",
      "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-18T11:45:00-07:00",    "event_title": "Robotron Autopsy: Learning About Hardware From Vintage Video Games",
      "speaker_ids": [1106], "event_id": 1160,
      "track_id": 30,
      "description": "Studying and building hardware is easier than you think. Using software concepts as a metaphor, I will reverse-engineer the 1982 arcade game machine \"Robotron: 2084\" and reimplement it in modern hardware.",
      "start_time": "2013-06-18T11:00:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T11:45:00-07:00",    "event_title": "Product Management in the Open (Source) - community and direction",
      "speaker_ids": [795], "event_id": 1085,
      "track_id": 26,
      "description": "Help! We want to have a product that is coherent and which solves problems that are relevant, but we've never had product management in our open source project... what do we do?\r\n\r\nOr...\r\n\r\nHelp! I'm now a product manager in an open source organization that has never had product management.... what do we do?\r\n\r\nProduct Management is a generally well defined discipline inside large corporate organizations. But how does it work in the open source world? Do we need it? How does product consensus happen in open source?\r\n\r\nLarissa has been a product manager at two open source non profit organizations and is now working on product management process -- this session will be more about sharing \"what works\" than about someone at the front talking with slides. Bring your ideas!",
      "start_time": "2013-06-18T11:00:00-07:00",
      "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-18T11:45:00-07:00",    "event_title": "Test Driven Development with AngularJS",
      "speaker_ids": [1314], "event_id": 1007,
      "track_id": 28,
      "description": "Test Driven Development is widely recognized as a proven method to improve both the quality and maintainability of code.  But a new breed of application, the Single Page Application, has become popular, and the need to test client-side JavaScript (never a commonly tested language) is ever more urgent.  Many frameworks have arisen to address this need.  Commonly referred to as JavaScript MVC frameworks, they allow us to build ever larger applications in the browser.  Angular JS is unique among these frameworks because it was built from the ground up to support automated testing.  This talk will cover how to do test driven development with Angular JS.",
      "start_time": "2013-06-18T11:00:00-07:00",
      "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-18T11:45:00-07:00",    "event_title": "Running with Scissors: Open Source Team Dynamics ",
      "speaker_ids": [515], "event_id": 1113,
      "track_id": 29,
      "description": "We can fall into a ton of categories. When asked for your affiliation, it means that you're being asked for your identity. You're asked for who you are, who you're being in the space, and you're going to have to live up to that. At the same time, other people are bringing who they are into the space. This can be a project space, a collaborative space, or a corporate space. \r\n\r\nWe'll talk about how each of those spaces work (without getting super deep into sociology/anthropology -- although I'm happy to talk about that too) - ways they interact, ways to be effective  and how to play within these particular structures. \r\n\r\nHint: it's not about you. ",
      "start_time": "2013-06-18T11:00:00-07:00",
      "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-18T11:45:00-07:00",    "event_title": "What Is That Process Doing? ",
      "speaker_ids": [1342], "event_id": 1069,
      "track_id": 27,
      "description": "We'll see how to:\r\n\r\n* See what a process that's stuck is stuck doing.\r\n* See where a process that can't find its config file is looking for it.\r\n* See how a process is invoking some other program.\r\n* See where a process is writing its logs to.\r\n* See what libraries a process is actually using -- including C extension modules for a program written in Python, Ruby, or the like.\r\n* Identify where a slow process is spending its time.\r\n* See inside a process, and even examine Python, Ruby, etc., programs in their own languages' terms.\r\n\r\nIn fact, with @strace@ we can spy on everything a process does that interacts with the filesystem, the network, other processes, or anything else outside its own borders -- even the clock.  With @perf@ we can count clock cycles as we follow the CPU all around the program's logic and even into the kernel.  With @gdb@ we can study everything in memory and run any code.  We'll see how to use these tools and others.\r\n",
      "start_time": "2013-06-18T11:00:00-07:00",
      "presenter": null}, {"room_title": null,
      "end_time": "2013-06-18T13:30:00-07:00",   "event_title": "Lunch",
      "event_id": 106, "description": "", "start_time": "2013-06-18T12:00:00-07:00"}, {"room_title": "B204",
      "end_time": "2013-06-18T14:15:00-07:00",    "event_title": "Expanding Your Empathy",
      "speaker_ids": [1405], "event_id": 1148,
      "track_id": 29,
      "description": "I believe empathy is the core competency that is missing from much of the efforts to push the tech community in a direction towards more diversity of all kinds. Companies, communities and conferences cannot expect everything to magically change until they're willing to go deep and examine the systemic patterns and structures that keep underrepresented communities from feeling safe and welcome in the tech space. \r\n\r\nWhen confronting racism results in a critique of the manner in which the offender was confronted by the people calling themselves supporters, it makes it that much harder to address the real issues.\r\n\r\nIf a man's first response to a woman complaining about a sexist incident or a sexual assault is to defend all the men who 'aren't like that,' that shows a lack of empathy. It keeps the focus on how men are being perceived, not empathizing with a woman who has been hurt.  \r\n\r\nThis talk is for people in positions of all sorts of privilege who consider themselves allies to underrepresented minorities and want to learn how to be more effective allies.\r\n\r\nWe'll talk about what it's like to live as a minority--why someone might have what seems to you like an 'overreaction' to something that seems small.\r\n\r\nHow to stop, drop, and empathize before you go on the personal defensive for anger that's directed at a group that you happen to be a part of, even if you didn't specifically do anything wrong.\r\n\r\nWe'll talk about tone policing, derailing, man-splaining and other hurtful behaviors that are sometimes practiced by well meaning people who consider themselves allies. \r\n\r\nLeave your ego at the door and come with an open heart. \r\n\r\nSlides for this presentation can be found at: https://speakerdeck.com/kronda/expanding-your-empathy\r\n\r\n<script async class=\"speakerdeck-embed\" data-event_id=\"9a8774b0bc01013049c27272943a3f76\" data-ratio=\"1.2994923857868\" src=\"//speakerdeck.com/assets/embed.js\"></script>",
      "start_time": "2013-06-18T13:30:00-07:00",
      "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-18T14:15:00-07:00",    "event_title": "Dirty Tricks of Computer Hardware: What You Don't Know Will (Probably Not) Kill You",
      "speaker_ids": [1019], "event_id": 1071,
      "track_id": 27,
      "description": "Software programming presents this wonderful abstraction of hardware -- signals are strictly digital, logic circuits conform perfectly to exacting specifications and datasheets, and everything is just peachy.  Right?\r\n\r\nNooo.  In this talk, I will dive into common aberrant behaviors of storage hardware -- how most people think they can fail, subtle ways in which they can also go haywire, and most importantly, how the operating system tries to work around all those bugs to ensure that you don't lose your mind in the first fifteen minutes.  I'll also discuss how your application programs can make the world a safer place for computing.\r\n\r\nIf we're really lucky, I'll have enough time left over to talk about other kinds of hardware failures.  But most people consider their data to be paramount, so we'll start with that.",
      "start_time": "2013-06-18T13:30:00-07:00",
      "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-18T14:15:00-07:00",  "event_title": "The Perl Renaissance",
      "speaker_ids": [511], "event_id": 1038,
      "track_id": 27,
      "description": "The Perl Renaissance is in full swing. Object frameworks and syntax have been undated, web frameworks are easy and powerful, and modules are easy to manage and install.  We'll cover:\r\n\r\n* Overhauling Perl's Object Oriented framework with Moose.\r\n* Using MooseX::Method::Signatures for beautiful classes.\r\n* Building web applications using Dancer\r\n* Not worrying about web servers by using Plack.\r\n* Critiquing your code with Perl::Critic\r\n* Write amazing regexps with named captures.\r\n* Install new modules quickly and easily with cpanminus\r\n* Manage Perl installations easily with perlbrew\r\n* A whole swag of new features with perl 5.10–5.16\r\n* Much, much more!\r\n\r\nNo prior Perl knowledge required!",
      "start_time": "2013-06-18T13:30:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T14:15:00-07:00",   "event_title": "DIY Electric Vehicles",
      "speaker_ids": [1095], "event_id": 1060,
      "track_id": 30,
      "description": "Electric vehicles are nothing new, yet have are still unfamiliar to the American, yet are one of the most popular modes of transport in many other countries. An estimated 120 million e-bikes navigate the roads of China every day. That's half as many as cars on American roadways. \r\n\r\nI would like to tell my story of constructing an electric bicycle with no official training in electric vehicles, special tools, or even electronics. I'd also like to inform everyone how they can create one as good or better than commercial offerings, licensing them, and getting support from the EV community.\r\n\r\nElectric bicycles have not caught on in the US, however that doesn't mean they are unavailable. With a few simple tools, some basic information, and either money or thriftiness one is able to construct electric vehicles with relatively little difficulty or surprises.\r\n\r\nSeveral open source designs such as the OpenReVolt motor controller have emerged for both whole vehicles and individual components. These can give the amateur builder some great ideas and tools to use when undertaking a project like this.",
      "start_time": "2013-06-18T13:30:00-07:00",
      "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-18T14:15:00-07:00",   "event_title": "Negotiation: Because You're Worth It",
      "speaker_ids": [771], "event_id": 1019,
      "track_id": 26,
      "description": "Come on, who likes having to negotiate? (Well, when you put it like that!)\r\n\r\nActually, I love negotiating, and I'm here to teach you a skill that can not only become great fun with a bit of practice, it can help you get more out of all of your relationships: whether work, open source, or personal!\r\n\r\nWe'll look at what negotiation actually means, ways to approach it collaboratively, and how to make sure everyone comes out ahead. There'll be some practical exercises, and plenty of homework!",
      "start_time": "2013-06-18T13:30:00-07:00",
      "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-18T14:15:00-07:00",    "event_title": "Metrics - What's your code actually doing?",
      "speaker_ids": [1388], "event_id": 1105,
      "track_id": 28,
      "description": "Code often performs in unexpected ways. Often our mental model of expected performance versus actual performance is wrong. In order to understand how code is actually performing, it has to be measured. \r\n\r\nHaving actual quantitative data to inform code-related decisions is critical for any production systems. This talk will cover the value of having good metrics, what defines good metrics, how to add them, and how they can be used and interpreted. \r\n\r\nSome of the open source tools that will be discussed will be StatsD, Yammer's 'Metrics' library, and Graphite. I'll take you through how to start using these tools as well as several advanced usage tips and best practices.",
      "start_time": "2013-06-18T13:30:00-07:00",
      "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-18T15:15:00-07:00",    "event_title": "FiveUI: Open-source UX tests for the common good",
      "speaker_ids": [1311, 1328], "event_id": 1022,
      "track_id": 28,
      "description": "In this session, we will talk about several use cases for the FiveUI tool: enforcing UI consistency, writing UI guidelines, regression testing, and accessibility testing.",
      "start_time": "2013-06-18T14:30:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T15:15:00-07:00",    "event_title": "Terraformer - Open Source Geometry for Javascript",
      "speaker_ids": [1365], "event_id": 1087,
      "track_id": 30,
      "description": "Terraformer is an open source Geometry toolkit giving you access to multiple geo formats and coordinate systems, as well as basic geometric functionality for the browser and node.js.\r\n\r\nLearn more about Terraformer at https://github.com/esri/Terraformer",
      "start_time": "2013-06-18T14:30:00-07:00",
      "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-18T15:15:00-07:00",    "event_title": "Bugs, bugs, bugs!",
      "speaker_ids": [575, 1353], "event_id": 1052,
      "track_id": 29,
      "description": "Liz Henry and Andre Klapper, bugmasters from Wikimedia, Mozilla, and GNOME, argue entertainingly about bug management. We will reveal our best Bugzilla hacks! And we'll delve deep into the philosophies of bug fixing in the context of large open source collaborations, while showing practical examples of amazing cleverness and utility.",
      "start_time": "2013-06-18T14:30:00-07:00",
      "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-18T15:15:00-07:00",   "event_title": "It's OK to be Average",
      "speaker_ids": [771], "event_id": 1018,
      "track_id": 29,
      "description": "We regularly talk about how to get new people into an open source project, how to get the most out of our volunteers, and how to encourage people to become more involved.\r\n\r\nThis talk will work on the other side of that equation: meeting contributors where they're at, welcoming folk who might not want to become core committers, learning what our projects can do to be more open to all.\r\n\r\nAnd in the process, you'll get a healthier, more vibrant, and much more diverse community. How cool is that!?\r\n\r\nWe'll look at some examples of projects that do this well (and not so well!), talk through little things you can implement to make big changes, and cover both the technical and social sides of contributor care and feeding.",
      "start_time": "2013-06-18T14:30:00-07:00",
      "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-18T15:15:00-07:00",   "event_title": "Pro Bash Development; Way Beyond Shell Scripting",
      "speaker_ids": [1336], "event_id": 1032,
      "track_id": 30,
      "description": "Lots of programmers whip up small- to medium-sized scripts in Bash (or pure sh), but I write full-blown programs in Bash, complete with libs, docs, and test suites.  If you didn't look at the source, you'd never know it was Bash and not Perl, Python, PHP, Ruby, or any other language.\r\n\r\nWhy do such a thing? There's actually a strong argument for using Bash for programs that make extensive use of standard system commands.  An amazing amount can be done with awk, sed, sort, read, pipes, subshells, etc.  I'll show you how.\r\n\r\nNo program is \"professional grade\" unless it's modular and tested.  You can do this with Bash, too.  Bash has some awareness of libraries, but none of testing.  That's ok: I'll show you how both can be done easily and sanely.\r\n\r\nIf you're a professional developer that spends most of the time in a Unix/Linux shell--sysadmins, DBAs, etc.--then join this talk to learn how the Bash shell you're probably already using can also be a very powerful programming language.",
      "start_time": "2013-06-18T14:30:00-07:00",
      "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-18T15:15:00-07:00",    "event_title": "Innovating Faster with a Micro-Service Architecture using SBT, Continuous Delivery, and LXC",
      "speaker_ids": [359], "event_id": 989,
      "track_id": 28,
      "description": "Over the past 4 years, the production architecture at the \"Gilt Groupe\":http://www.gilt.com/ has evolved from a single monolithic web application to a highly-distributed collection of more than 200 micro-services and small web applications.  This architectural shift allows greater scalability and faster, less coupled development of new features, but also presents challenges around maintaining consistent development, testing, and deployment processes. We solved these challenges by enabling continuous integration and delivery with a novel collection of tools and infrastructure support we refer to as ‘Ion Cannon’. \r\n\r\nIn this talk, I’ll discuss the history and motivation behind this architectural shift , and share some quick wins and early stumbles.  Then I’ll show how we use SBT for development and packaging; the architecture of Ion Cannon; and why we selected LXC as a lightweight virtualization solution for production deployment.",
      "start_time": "2013-06-18T14:30:00-07:00",
      "presenter": null}, {"room_title": null,
      "end_time": "2013-06-18T15:45:00-07:00",   "event_title": "Afternoon Tea",
      "event_id": 107, "description": "", "start_time": "2013-06-18T15:15:00-07:00"}, {"room_title": "B202/203",
      "end_time": "2013-06-18T16:30:00-07:00",   "event_title": "Cool Features of the Z Shell (zsh)",
      "speaker_ids": [1395], "event_id": 1130,
      "track_id": 28,
      "description": "Z Shell is a UNIX shell with a bunch of cool features. Learn about installing and configuring zsh with some of my favorite features. Topics include:\r\n\r\n# Installing latest version of zsh\r\n# Changing directories without cd (autocd)\r\n# Making autocd more powerful with the cdpath\r\n# Completion of paths and commands\r\n# Command history features\r\n# Spelling correction\r\n# Installing command completion libraries for programs such as Maven\r\n# Configuring zsh or using oh-my-zsh",
      "start_time": "2013-06-18T15:45:00-07:00",
      "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-18T16:30:00-07:00",    "event_title": "debugging without borders",
      "speaker_ids": [1210], "event_id": 1004,
      "track_id": 28,
      "description": "There's an art to finding out what's wrong when you can't ask directly, when you can't peek under the covers, when you have to guess a little.  I'll go over some techniques I've come across in my years of doing developer support and remote sysadminnery, but we'll also brainstorm next-generation techniques and help evolve existing ones.  Maybe I can't see your source code, but you'll let me see the stack trace from rails.  Maybe you won't run traceroute for me, but I can grab your browser IP from my logs and get a reverse trace.  Maybe you don't even know what a server is, but I can help you get some software installed on it from 5,000 miles away.  And maybe you're in Antarctica and you need emergency surgery from an expert who can't see you...\r\n\r\nAll of these are real problems that have really been solved.  Why, how, and how to do better will be focus of this talk.\r\n\r\n",
      "start_time": "2013-06-18T15:45:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T16:30:00-07:00",    "event_title": "Clone A Git Together Into Your Town",
      "speaker_ids": [445], "event_id": 1131,
      "track_id": 29,
      "description": "This talk will elucidate the history and motivation for the \"PDX Git Together\":http://pdxgit.com community and predictions for where it is headed in the future. In addition, an easy to follow checklist will be presented for anybody that would like to start a Git community, i.e. spreading the \"DAG\":https://en.wikipedia.org/wiki/Directed_acyclic_graph, to a town of their choice. \r\n\r\nPart of this checklist is an in-depth introduction to the infrastructure of http://pdxgit.com, which uses \"Github Pages\":http://pages.github.com and \"Twitter Bootstrap\":http://twitter.github.com/bootstrap/. The website is powered by a \"Github repository\":https://github.com/pdxgit/pdxgit.github.com which updates the website every time a new commit is pushed. \r\n\r\nThis talk does not assume any prior knowledge of Git and will be focused more on how communities can effectively use tools such as \"Github\":http://github.com or \"BitBucket\":http://bitbucket.org to self-organize.\r\n\r\nOther items on the checklist are how to find a venue for your group and how to choose and codify your community guidelines. ",
      "start_time": "2013-06-18T15:45:00-07:00",
      "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-18T16:30:00-07:00",   "event_title": "Labor, ethics and computing",
      "speaker_ids": [1004], "event_id": 979,
      "track_id": 27,
      "description": "This talk is a frank and honest discussion about labor practices in every major facet of computing, with an examination of the ethics of labor in an industry that has conflicting values. Topics to cover:\r\n * interpreting various philosophical treatises on labor in regards to both proprietary and open hardware/software\r\n * environmental impact of hardware manufacturing and reclamation\r\n * social impact of environmental problems due to hardware\r\n * sexism, racism, classism and their impact on facets of computing\r\n * a brief history of the US labor movement\r\n * suggestions for how to address and improve labor issues",
      "start_time": "2013-06-18T15:45:00-07:00",
      "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-18T16:30:00-07:00",  "event_title": "Hacking social software with pump.io",
      "speaker_ids": [40], "event_id": 1097,
      "track_id": 27,
      "description": "pump.io is a modern, high-performance federated social network server. It gets social activities from one part of the network to another, based on the embedded social graph.\r\n\r\nThis discussion will start with an overview of the design of the pump.io server software, its API, and supported protocols. It will discuss how client applications are developed.\r\n\r\nThe talk will finish with a deep dive into a simple Web client written in Python that implements a simple zombie-bite social game.\r\n\r\nAttendees should be interested in social software development, and familiar enough with Python to follow along in a demonstration.",
      "start_time": "2013-06-18T15:45:00-07:00",
      "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-18T17:30:00-07:00",   "event_title": "Data & Applications Across the Void :: Distributing Systems",
      "speaker_ids": [925], "event_id": 932,
      "track_id": 28,
      "description": "Today distributing applications is relatively easy, until you get to the data side of things. This is where the complexity in most applications comes into focus, where does the data go? How do I replicate or synchronize the data? How do or where do I cache data? What's the geographic issues with data in one place and applications in another? How does the gravity of the data affect my application?\r\n\r\nThis talk will hone in on key details around implementing a true distributed system across geographically dispersed areas and how to provide the end user a solid synchronized experience while using the application. Examples will be provided with hybrid computing solutions and distributed software solutions including distributed databases, PaaS Deployment packaging and other key technologies.",
      "start_time": "2013-06-18T16:45:00-07:00",
      "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-18T17:30:00-07:00",    "event_title": "Literate Programming for the 21st Century",
      "speaker_ids": [414], "event_id": 964,
      "track_id": 28,
      "description": "Donald Knuth once wrote:\r\n\r\nbq. _Let us change our traditional attitude to the construction of programs: Instead of imagining that our main task is to instruct a computer what to do, let us concentrate rather on explaining to human beings what we want a computer to do._\r\n\r\nHe then wrote a series of papers and a book about how programming shouldn't be a collection of computer-oriented files with comments, but a human-focused document sprinkled with code. He called his programmatic idiom, _Literate Programming_.\r\n\r\nDoug McIlroy and many others have claimed verbosity, and with the exception of some projects, like Docco, Literate Programming became an out-dated concept from last century's academia. However, succinct languages like Scala and Clojure, as well as a desire to bring community members together to work on open source projects, literate programming may have found its place.\r\n\r\nIn this session, I'll talk about the good and challenging aspects of literate programming and how it relates to the modern agile developer. And since success requires good tools, I'll demonstrate the concepts using \"org-mode\":http://www.orgmode.org and its Babel project to _tangle_ architectural thoughts and developer notes with code to implement a vibrant, helpful document for your peers to make your code easier to understand and maintain.",
      "start_time": "2013-06-18T16:45:00-07:00",
      "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-18T17:30:00-07:00",   "event_title": "Moonlighting in Sunlight",
      "speaker_ids": [512], "event_id": 1134,
      "track_id": 26,
      "description": "This session will cover some of the legal issues around having a day job and working on open source projects on the side. Generally applicable to any other mix of projects--freelancing for multiple clients, for yourself, for the public, whatever.\r\n\r\nThe main issue is intellectual property: how to satisfy an employer’s need to have security about what IP they own or are using--whether they are a completely proprietary company or an already open source/open-friendly company--and help open source projects avoid trouble about uncertain provenance of contributed code.\r\n\r\nOther typical employment agreement clauses like non-competes, duty of loyalty, no moonlighting, etc., will also be addressed.\r\n\r\nThis is a reprise of my talk with the same event_title from 2010, but updated and more focused.",
      "start_time": "2013-06-18T16:45:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T17:30:00-07:00",   "event_title": "Simple Questions Should Have Simple Answers",
      "speaker_ids": [111], "event_id": 1157,
      "track_id": 29,  
      "description": "If a developer ever says \"it's really simple\", run and do not look back.\r\n\r\nDevelopers often throw around terms like \"easy\" and \"obvious\" but what do they tell them about what to do to make something \"easier\" and \"more obvious\"?  What does it tell them about whether somebody else will find something \"easy\" and \"obvious\"?  Not a lot.\r\n\r\nGiving simple questions simple answers tells how to take action to make things easier and more obvious to the casual user.  Embracing the task of providng simple answers rejects the fallacy that complex implementations mean complex answers.  It creates a new relationship of respect between the user and the developer; a good user can ask a simple question illuminating what people want to do, and a good developer fulfills the user's desire for a simple answer.\r\n\r\n* What does it mean to be simple?\r\n* How do you find it?\r\n* What are its benefits?\r\n* What happens when you don't seek simplicity?",
      "start_time": "2013-06-18T16:45:00-07:00",
      "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-18T17:30:00-07:00",    "event_title": "FirefoxOS",
      "speaker_ids": [1095], "event_id": 1062,
      "track_id": 27,
      "description": "FirefoxOS has several critically important qualities that make it an important player in the mobile landscape. Just as Firefox kept the web an open platform (and remains to do so), FirefoxOS aims to do the same for the mobile space.\r\n\r\nTo accomplish all this FirefoxOS had to pioneer some new territory, including the creation of standards for many mobile-type things that didn't exist on the desktop. Additionally, it was important that web developers should already know how to create apps using techniques and technologies that are already familiar with them.\r\n\r\nDemonstrations will be given with simulators that can be used on any personal computer (Windows, Mac, Linux), as well as with live prototype devices. If time permits, I can discuss the FirefoxOS build system and why it is perfect for porting to other devices, and already has for popular devices such as the Raspberry Pi.",
      "start_time": "2013-06-18T16:45:00-07:00",
      "presenter": null}, {"room_title": "Hacker Lounge",
      "end_time": "2013-06-18T22:00:00-07:00",   "event_title": "Hacker Lounge Open",
      "event_id": 108, "description": "", "start_time": "2013-06-18T17:30:00-07:00"}, {"room_title": "B202/203",
      "end_time": "2013-06-18T18:30:00-07:00",    "event_title": "Geek Choir - Fast!",
      "speaker_ids": [240], "event_id": 1143,
      "track_id": 29,
      "description": "People often refer to the connections between mathematics and music; there are also many similarities between open-source projects and volunteer community musical organizations. In this session, we will go over various team-building exercises using the human voice. We will discuss what open source tools are available to assist in creating music, go over the engineering involved in composing the exercises, and look over various online repositories of public-domain works that can be used for choral team-building. Mostly, we will sing.",
      "start_time": "2013-06-18T17:45:00-07:00",
      "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-18T20:30:00-07:00",
      "event_title": "Clonezilla BoF",
      "speaker_ids": [736], "event_id": 1169,
      "track_id": 31,
      "description": "Clonezilla is GPL software for system deployment. It’s similar to Symantec Ghost or Acronis True Image. It supports a variety of file system types, including that of GNU/Linux, Mac OS, MS Windows, FreeBSD, Minix and VMWare ESX. Two types of Clonezilla are available, Clonezilla live and Clonezilla SE (server edition). Clonezilla live is suitable for single machine backup and restore. While Clonezilla SE is for massive deployment, this BoF is intended for system administrators at Opensource Bridge to meet and discuss any ideas and issues about Clonezilla they might have.",
      "start_time": "2013-06-18T19:00:00-07:00",
      "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-18T20:30:00-07:00",    "event_title": "Portland R User Group - Hackathon",
      "speaker_ids": [987], "event_id": 1167,
      "track_id": 31,      "description": "The Portland R User Group (http://www.meetup.com/portland-r-user-group/) meets the third Tuesday of the month. For June, this falls during Open Source Bridge. At the meeting May 21, we decided to have a hackathon at Open Source Bridge for the June meeting, Tuesday, June 18.\r\n\r\nFor those new to R, I'll have tools available to install the latest version of R on Windows, Macintosh or Linux, including (on Linux) building R from source.",  "start_time": "2013-06-18T19:00:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-18T20:30:00-07:00",    "event_title": "Ruby Beginners Meetup",
      "speaker_ids": [11], "event_id": 1166,  "track_id": 31,      "description": "Our monthly beginner's Ruby meetup is happening at Open Source Bridge this month.\r\n\r\nIf you have a question or a topic you'd like discussed at the meeting, feel free to post to the <a href=\"http://groups.google.com/group/pdxruby-beginners\">mailing list</a>.\r\n\r\nhttp://calagator.org/events/1250464245",  "start_time": "2013-06-18T19:00:00-07:00",   "presenter": null}, {"room_title": "Sanctuary",
      "end_time": "2013-06-19T09:45:00-07:00",    "event_title": "Keynote — Alex “Skud” Bayley",
      "speaker_ids": [1455], "event_id": 1162,  "track_id": 29,      "description": "Keynote by Alex “Skud” Bayley",  "start_time": "2013-06-19T09:00:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-19T10:00:00-07:00",   "event_title": "Coffee Break",
      "event_id": 109, "description": "", "start_time": "2013-06-19T09:45:00-07:00"}, {"room_title": "B301",
      "end_time": "2013-06-19T11:45:00-07:00",   "event_title": "Teaching Robots to See With Javascript",
      "speaker_ids": [1317], "event_id": 1014,  "track_id": 30,      "description": "As we start to use javascript to control quadrocopters and robots, it becomes\r\nimportant that they can _see_ with images from cameras onboard.\r\n\r\nIn this talk we'll take a step back and look at the field of computer vision;\r\nlook at some of the exciting practical problems that can be solved with CV\r\ntechniques, and look at how we can do this with javascript.\r\n\r\nWhether it's detecting and recognising faces, building a picture of\r\nsurroundings from a video stream, or tracking shapes, we'll look at how we can\r\nmake our javascript programs see.\r\n\r\n\r\n",  "start_time": "2013-06-19T10:00:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-19T11:45:00-07:00",    "event_title": "How to multiply small integers while <del>Markus</del> human",
      "speaker_ids": [54], "event_id": 993,   "track_id": 27,      "description": "We all know how to multiply, more or less.  And we can all multiply small integers in our heads when the need arises, often even arriving at something resembling the correct answer.  You might even think that there was nothing more to say about the topic.\r\n\r\nBut, as it turns out, these two facts are almost entirely unrelated, and the puzzling consequences of this meta-fact are just the sort of crack we need to pry open the door to one of the greatest mysteries of our time, expose software development's dirty little secret (you know, the one which may well bring down our whole civilization), learn what makes people wealthy, and have a laugh or two in the process.\r\n\r\nTime permitting, there will be a quiz at the end.\r\n\r\n__Note: while this is technically a continuation of last year's talk (the gophers, go & golf-balls-plus-TNT one), I give you my word that people who saw that talk will not have an unfair advantage in understanding this one.__",  "start_time": "2013-06-19T10:00:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-19T11:45:00-07:00",    "event_title": "Just Don't Lick the Cookie: an open discussion about organizational dysfunction",
      "speaker_ids": [1289, 449], "event_id": 1132,  "track_id": 29,      "description": "Organizational dysfunction can be incredibly confusing and frustrating or predicable and sometimes even funny.  We hope to show you the lighter side of working with passionate people who do not, from your perspective, always act rationally.\r\n\r\nIn the first 15 minutes of this talk, we'll identify and name common forms of organizational dysfunction.  Licking the cookie, yakshaving, and bikeshedding  are all classic examples of behaviors that can lead to group dysfunction, but with a little bit of theory, we hope you can help us add new examples to our list.  The second portion of this presentation will be an open discussion about your own experiences.  We'll brainstorm as a group how you can get what you need done, without playing into or feeding dysfunction in your own organizations.\r\n\r\nAt best, we hope you'll leave this presentation being a force for collaboration, support, communication and creativity in your community.  At worst, you'll discover that your situation is truly hopeless.",  "start_time": "2013-06-19T10:00:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-19T11:45:00-07:00",    "event_title": "Rust: A Friendly Introduction",
      "speaker_ids": [1249], "event_id": 970,  "track_id": 28,      "description": "When writing systems-level applications like operating systems, device drivers, and Web browser engines, many things can go wrong. Null pointers, buffer overflows, and memory leaks all occur in C and C++-based applications in the wild, and can all cause serious security vulnerabilities. C and C++ compilers and tools are at best only partially able to detect these problems during development. While memory-safe languages such as Haskell and Scala solve these problems, historically, systems programmers have not found these languages acceptable for meeting their performance goals. Rust, a new open-source language being stewarded by Mozilla, aims to make memory safety bugs a thing of the past without sacrificing performance. Rust supports large-scale programming and its needs for reliability, efficient use of space and time, and concurrency.\r\n\r\nIn this tutorial talk, I will show you how to write fast code in Rust with the help of a compiler that detects many potential bugs at compile time. I will start by showing you how to write simple prototypes in a subset of Rust that uses garbage collection. Then, I will refine these examples to use Rust's \"borrowed pointers\". Using borrowed pointers eliminates the overhead of garbage collection because the compiler can determine these pointers' lifetimes at compile time. I will show you how to manage memory in Rust in ways that are just as efficient as they would be in a C++ program but enjoy stronger compile-time correctness checking than C++ compilers provide. As I'll explain, this style of coding requires more thought during development because you have to be explicit about the relationships between data structures in memory, but it pays off in the long term by eliminating dangling pointers and memory leaks, without incurring unwanted memory management overhead.\r\n\r\nAll the examples I'll show will be based on real applications, potentially drawn from an audio decoder, an NES game emulator, and a prototype Web browser engine (Servo - https://github.com/mozilla/servo - under development at Mozilla). All examples will be adapted from open-source programs that are freely available on Github. I'll assume that audience members are comfortable programming in at least one language and have at least a passing familiarity with either C or C++.",  "start_time": "2013-06-19T10:00:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-19T11:45:00-07:00",    "event_title": "Training the trainers",
      "speaker_ids": [810], "event_id": 1066,  "track_id": 28,      "description": "OpenHatch's Open Source Comes to Campus event series has taught more than a hundred people how to get involved in free and open source software. Between these and other affiliated events including Railsbridge Boston and the Chicago Python Workshop, our community has learned a lot about how to create events with effective mentorship.\r\n\r\nIn this tutorial, we will work together through lecture and hands-on exercises.\r\n\r\nFirst, we discuss together the motivation behind newcomer-oriented events in the first place, with concrete examples from OpenHatch-affiliated events.\r\n\r\n* Setting outreach goals\r\n* Making them measurable\r\n* Finding existing communities to work with (including the story of the Boston Python Workshop)\r\n\r\nWe discuss how Open Source Comes to Campus' approach to mentorship has changed over the >2 years the program has been running.\r\n\r\nWe then demonstrate a handful of ways, with varying effectiveness, of identifying students at a newcomer-oriented workshop that may not be getting the most out of the workshop. You'll see how to identify those that need help, and even practice interrupting a demonstration attendee to get them the help they are not yet asking for!\r\n\r\nWe will provide you a tour of a sample laptop setup guide, explain we write ours the way we do, and demonstrate what kinds of problems students typically face.\r\n\r\nFinally, attendees train using the mentor guide for Open Source Comes to Campus. This enables them to, after the conference, run these events in their home cities.\r\n\r\nMoreover, it enables them to reflect on the OpenHatch model. Open Source Comes to Campus is used here as an example, we open up the floor to active creation where attendees discuss with each other (and event organizers) how to apply these principles to their own efforts.\r\n\r\nWe hope that the event leads to a thousand outreach events blooming, and that those events choose to become affiliated with OpenHatch! <https://openhatch.org/wiki/Events/Affiliated>\r\n\r\n(Also: co-presenters welcome! We'll need you, as TAs, as inspiration, and as curriculum review for this event, and as so much more!!)",  "start_time": "2013-06-19T10:00:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-19T11:45:00-07:00",    "event_title": "Firefox Bug Rodeo!",
      "speaker_ids": [575], "event_id": 1053,  "track_id": 28,      "description": "Hands-on Bugzilla wrassling, Firefox busting, barrel riding showdown. Enter the dazzling gladiatorial arena of BUG TRIAGE with MOZILLA! We will make bugzilla.mozilla.org accounts, practice reading and understanding bug reports, discuss why and how to investigate and add information to bugs, explore searches and reports, and feel the glorious feeling of contributing to open access to information and awesome browsers for all! \r\n\r\nBeginning, intermediate, and advanced open source contributors are all welcome. No coding experience is necessary. This is a good introduction to understanding the open source ecosystem of Mozilla and the structure of its projects -- and a way to explore where you might best contribute as a bugmaster, a developer, or in QA.  \r\n\r\nIn this workshop you are also allowed to complain as much as you like about your pet problems in any Mozilla product, to find the relevant bugs, and conspire to get other people to pay attention to them. ",  "start_time": "2013-06-19T10:00:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-19T13:30:00-07:00",   "event_title": "Lunch",
      "event_id": 110, "description": "", "start_time": "2013-06-19T12:00:00-07:00"}, {"room_title": "B201",
      "end_time": "2013-06-19T14:15:00-07:00",    "event_title": "Database Change Management",
      "speaker_ids": [1241], "event_id": 975,  "track_id": 28,      "description": "Most organizations do a good job of managing application code using source control and continuous integration.  But a surprising number are still in the dark ages when it comes to Database Change Management.\r\n\r\nKeeping databases up to date with application code does not need to be a nightmare.  This quick survey will introduce you to several Java based options for managing database changes including dbdeploy, Flyway, Liquibase, and others.",  "start_time": "2013-06-19T13:30:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-19T14:15:00-07:00",    "event_title": "Remote Pair Programming",
      "speaker_ids": [1397], "event_id": 1124,  "track_id": 28,      "description": "Pair programming can be incredibly productive, but how do you pair in a distributed team?\r\n\r\nActually, that's the wrong question. A better question is: how can you use remote collaboration tools (some old, some new) to improve *all* of your pairing sessions, whether you're sitting in the same room or strewn across multiple time zones?\r\n\r\nI'll share the setup I've been using for a year, show off what works, and talk about what I still struggle with. Bring your own experiences, and at the end, we can try to find out how many simultaneous connections it takes to crash tmux -- or the venue wifi, whichever comes first.",  "start_time": "2013-06-19T13:30:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-19T14:15:00-07:00",    "event_title": "Open Sourcing Depression",
      "speaker_ids": [108], "event_id": 949,  "track_id": 29,      "description": "In the spirit of open source, I'd like to shine a spotlight on depression. Not because it's easy, but because it's important. Mental illness affects many of us, but the stigma attached to it dissuades most people from talking about it openly. That's not how we make progress. With this talk, I want to do my part.\r\n\r\nI was diagnosed with depression and anxiety when I was thirteen, and I've been struggling with it my whole life. In this talk, I'll discuss how it has impacted my work as a developer, husband, and father.\r\n\r\nBy speaking openly about my own challenges and successes, I hope those struggling with mental illness will learn how to be happier and more productive, and others can better understand how to be helpful and supportive.",  "start_time": "2013-06-19T13:30:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-19T14:15:00-07:00",    "event_title": "HackRF: Software Defined Radio for Software People",
      "speaker_ids": [1475], "event_id": 1173,  "track_id": 30,      "description": "Getting into Software Defined Radio (SDR) used to require extensive\r\nhardware knowledge, but easy-to-use platforms like HackRF are changing\r\nthat.  The GNU Radio software framework is also easier to work with than\r\nit once was.  I'll show you how to get started with the software side of\r\nSDR and cover the essential techniques needed to discover, analyze, and\r\nproduce radio signals with GNU Radio and HackRF.\r\n\r\nMy concept for this talk is that most attendees already know what SDR is\r\nand why it is a cool phenomenon in the world of open source.  I'll start\r\nwith a very short introduction to HackRF and then spend 90% of the time\r\ndemonstrating practical SDR techniques the people can put to use\r\nimmediately if they have a HackRF or any other SDR hardware.",  "start_time": "2013-06-19T13:30:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-19T14:15:00-07:00",   "event_title": "Using Secure Boot for the powers of good",
      "speaker_ids": [1334], "event_id": 1028,   "track_id": 27,      "description": "UEFI Secure Boot is a specification describing a mechanism for configuring computers to refuse to boot any OS that hasn't been signed with a trusted key. Most major Linux distributions have now adopted solutions for handling it, and now people are beginning to consider how we can take advantage of it. This presentation will provide a brief introduction to UEFI Secure Boot and the approaches the free software community have taken to dealing with it, but will focus on how we can use it to gain genuine security benefits and improve confidence in cloud computing.",  "start_time": "2013-06-19T13:30:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-19T14:15:00-07:00",   "event_title": "HOWTO on secure software design with threat modeling",
      "speaker_ids": [522], "event_id": 1176,   "track_id": 27,      "description": "Leigh tells you things about security.",  "start_time": "2013-06-19T13:30:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-19T15:15:00-07:00",   "event_title": "Polling: It's Good Enough for the WWW & It's Good Enough for You",
      "speaker_ids": [1393], "event_id": 1153,  "track_id": 28,      "description": "Lately everyone loves pushing: you get push notifications on your iOS device, cloud to device messages on your Android device, and something about web sockets. Pushing seems natural. \"Hey! I have some data for you, let me send it to you,\" says the pusher. Too bad it doesn't scale effectively. Pushing is expensive and hard. It cannot take advantage of any caching and needs to keep track of failures and retries. \"Hey! I have some data for <%= @big_number %> of you, let me send it to all of you,\" says the pusher. \"Oh, some of you didn't get it? Who? When should I try again? How many times should I try?\"\r\n\r\nEvery time you want to push you can get away will polling cheaper and easier (almost). The WWW is built on polling. Your application will never need to scale to as big as the WWW. Let's see how Rails applications can use polling to scale effectively and what happens when you combine pushing and polling.",  "start_time": "2013-06-19T14:30:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-19T15:15:00-07:00",   "event_title": "Beginning Functional Programming in Scala",
      "speaker_ids": [1395], "event_id": 1118,   "track_id": 27,      "description": "This talk starts by defining functional programming, then moves into the implementation of these ideas in Scala. Scala is a hybrid language the supports both object-oriented and functional approaches to programming. First we'll look at the basic syntax of functions in Scala and define a few functions. Next we'll move the first level of functional programming by using our functions with the higher-order methods of the Scala collections library. We'll see how the functional approach makes it easy to switch processing a collection of objects to a parallel implementation. Finally, we'll take a look at the next level of functional programming by using function composition to extract common code from similar functions.",  "start_time": "2013-06-19T14:30:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-19T15:15:00-07:00",    "event_title": "What Is Async, How Does It Work, And When Should I Use It?",
      "speaker_ids": [1321], "event_id": 1008,   "track_id": 27,      "description": "Why is async hot now? Contemporary web apps trend towards web sockets and service-oriented architectures, which require very high numbers of concurrent connections, which makes async more necessary than before. There are a number of asynchronous frameworks available. I'll demo a popular one for Python: Tornado.\r\n\r\nAn async framework like Tornado allows a single thread to efficiently interleave concurrent I/O operations, using an event loop. I'll walk through the code for Tornado's event loop so you thoroughly understand the underlying process, and so you can forever avoid the mortal sin of blocking the event loop.\r\n\r\nOnce you grok the foundations of Tornado, you'll understand how asynchronous frameworks work in general and be ready to build very high-performance modern web applications.",  "start_time": "2013-06-19T14:30:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-19T15:15:00-07:00",    "event_title": "How My Kids Are Learning to Program By Talking",
      "speaker_ids": [103], "event_id": 1050,  "track_id": 29,      "description": "At some point in any project, my kids end up talking through what they want their program to do.  We then struggle to translate those stories into the format expected by the tool: either graphical blocks wired together in a diagram, or keywords in a full-fledged text programming language.\r\n\r\nThis is ridiculous--why can't the programming environment learn to understand their stories instead?  In this talk, I'll discuss some of the things we've tried to bridge this gap: speech recognition, text processing, and a friendly computer language that was designed exactly for this purpose in 1967.",  "start_time": "2013-06-19T14:30:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-19T15:15:00-07:00",    "event_title": "Library of the future: building the Multnomah County Library website",
      "speaker_ids": [1394], "event_id": 1117,  "track_id": 28,      "description": "The Multnomah County Library is the second largest public library in the U.S. by circulation. We are second only to the New York Public Library system. We move more books, music, movies (and more) per patron than anyone.\r\n\r\nThis February we launched a major redesign of the Library's website using Drupal as the content management framework and a software as a service social search front end with BiblioCommons. Unlike most Library websites, we've used BiblioCommons API combined with a site search powered by Apache Solr to build a unified search experience. Search on Twilight and we'll not only show you our collection of Twilight DVDs and books, but we'll also show you our Twilight inspired events and blogs posts from Librarians that will connect the dots about the importance of vampire stories in popular culture.\r\n\r\nMobile now represents over 20% of the traffic to the Library's site. With a new responsive design and a focus on mobile first content. We've built an engine of discovery that you can reach on the go.\r\n\r\nJoin Joshua Mitchell, Enterprise and Web Applications Manager at Multnomah County, and his team as they walk you through this monumental achievement.",  "start_time": "2013-06-19T14:30:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-19T15:15:00-07:00",   "event_title": "My First Year of Pull Requests",
      "speaker_ids": [1297], "event_id": 1063,  "track_id": 29,      "description": "I'm a user of open source tools and an occasional contributor via pull requests, and as a relatively new developer, it's very scary to hit the 'Submit Pull Request' button on Github.\r\n\r\nI'll talk about:\r\n- Why I use open source tools\r\n- How I contribute back to the project\r\n- My favorite experiences with maintainers",  "start_time": "2013-06-19T14:30:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-19T15:45:00-07:00",   "event_title": "Afternoon Tea",
      "event_id": 111, "description": "", "start_time": "2013-06-19T15:15:00-07:00"}, {"room_title": "B302/303",
      "end_time": "2013-06-19T16:30:00-07:00",   "event_title": "Mobile Sync, HTML5, and NoSQL",
      "speaker_ids": [459], "event_id": 1079,   "track_id": 27,      "description": "Mobile network latency is highly variable, but we know that a snappy user experience can make the difference between success and failure in the mobile world.\r\n\r\nHTML5 is great for developer productivity, but it gets a bad rap on performance. In this talk I'll show how you can use Couchbase Lite to sync data to mobile devices, so that users don't have to wait for network round trips each time they interact with application data.\r\n\r\nI'll show a demo of two apps (one native and one HTML5) interacting with the same data set via sync. Attendees who want to hack along will have a chance to build and run the app on their laptops, and have it sync with the same dataset as my demos.\r\n\r\nAll the code, from examples to core database technology, is open source, so I'll pepper my examples with links to actual source code and repositories. ",  "start_time": "2013-06-19T15:45:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-19T16:30:00-07:00",   "event_title": "Unicode Best Practices",
      "speaker_ids": [1349], "event_id": 1065,  "track_id": 28,      "description": "This talk will help make supporting Unicode easier by providing some of the best practices for your projects—whether open source libraries, RESTful services, or web applications.  We’ll briefly review Unicode and then dive into best practices for handling Unicode text in the following areas:\r\n\r\n* User experience\r\n* Collation (comparison and sorting)\r\n* Input, output, and logging\r\n* Security considerations\r\n* Debugging\r\n* Testing (unit tests and QA)\r\n\r\nThis is a programming language–agnostic talk and will cover general best practices for developing with Unicode as well as some important tips related to various popular programming languages.",  "start_time": "2013-06-19T15:45:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-19T16:30:00-07:00",    "event_title": "Diversity in open source: What's changed in 2012 and 2013",
      "speaker_ids": [856, 449, 1410, 575, 810], "event_id": 1051,  "track_id": 29,      "description": "2012 was full of good news for diversity in open source and open tech/culture. Join us for a panel reviewing the positive news of 2012 and 2013 for women, people of color, LGBTQ folks, and more. Bring your own story and share!",  "start_time": "2013-06-19T15:45:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-19T16:30:00-07:00",    "event_title": "Agile from the Open Source Trenches: Making agile work for Wikipedia engineering teams",
      "speaker_ids": [1108], "event_id": 954,  "track_id": 29,      "description": "Wikipedia is one of the world’s top 5 websites. It is powered by a completely open source technology stack. Wikipedia’s innovative engineering projects in language and mobile engineering have been using agile development to create high-quality features and apps in faster iterations.\r\n\r\nThis talk examines what we have needed as pre requisites as well as what works and what doesn’t when using agile development for large open source projects.\r\n\r\nMy teams have benefited by maintaining a fixed-schedule sprint duration, making time for regular sprint retrospective discussions, having short sprint planning sessions, and keeping open communication channels in a distributed team.\r\n\r\nMy teams have been challenged by getting all team members to keep agile tracking documents up-to-date, keeping the software documentation itself up-to-date, and integrating QA.\r\n\r\nThis talk will help developers and engineering managers better understand and implement a successful agile process for their open source projects.",  "start_time": "2013-06-19T15:45:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-19T16:30:00-07:00",    "event_title": "Zero to root in 12 months / How We Mentor “Rock Star” Students",
      "speaker_ids": [1281, 1099, 175, 1282], "event_id": 1093,  "track_id": 29,      "description": "OSUOSL:\r\n\r\nOver the past ten years the OSU Open Source Lab (OSUOSL) has provided an amazing program for undergraduate students. Many of our students have moved on and created their own successful startups and have changed the landscape of open source themselves. This session will cover how we mentor our students and create rock stars in the industry.\r\n\r\nWhen our students start they barely know what they want to do with their careers and have maybe run Linux for six months if we’re luck. Within six months they have a basic understand of our infrastructure and programming projects. By the time they graduate within two to three years they are at least one to two years ahead of any other grad with all their hands-on knowledge.\r\n\r\nWe will cover everything from how we recruit, structure our interview, to how we do the mentoring and some history of how we’ve changed our mentoring over the years. I will also cover several unique aspects of how and why it works so well at OSU with the hope that other organizations can do the same thing.\r\n\r\nTheCAT:\r\n\r\nAt Portland State University’s Computer Action Team (CAT) we provide a wide variety of services (direct and remote login machines with nfs homedirs, web, mysql, postgres, project management, version control, collocation, virtualization, storage, backup, GPU through cuda, CAD tools) to the more than five thousand students at the Maseeh College of Engineering and Computer Science. We do this with a small set of full time administrators and a small army of students who we train up from literally nothing to becoming fully fledged(and fully rooted) members of the *nix, windows, and networking teams. In this talk we will present our methods and lessons including our teaching format, how we provide graduated access and responsibility through git and puppet, and our answers to the challenges faced by any IT department in higher education today.",  "start_time": "2013-06-19T15:45:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-19T17:30:00-07:00",   "event_title": "PHP for Pirates: pillaging interactive debugging from Ruby and JavaScript.",
      "speaker_ids": [1259], "event_id": 952,  "track_id": 28,      "description": "It's sad that in 2013, var_dump and die are still two of the most common debugging and reflection techniques in PHP.\r\n\r\nWhile it has improved somewhat in PHP 5.4, the PHP interactive shell (php -a) is not compelling enough to see regular use. The de facto replacement — Facebook's abandonware phpsh — is actually written in Python, which is a shame, since it's both possible and practical to do it in userland PHP code.\r\n\r\nBy exploring the interactive capabilities of other programming languages, I'll give you an idea of what is possible in an interactive shell, and the power it can bring to your development process. In this talk, we will examine the state of process control, reflection, code analysis and evaluation, and metaprogramming in PHP. I will cover practical techniques and tools which can be used today, and introduce PHP's missing read-eval-print loop, built on the Symfony Console component.\r\n",  "start_time": "2013-06-19T16:45:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-19T17:30:00-07:00",   "event_title": "Bitcoin and the Law - Whither Transactions?",
      "speaker_ids": [1381], "event_id": 1100, "track_id": 26,      "description": "In the before-times, Judge Frank Easterbrook gave a speech entitled \"Cyberspace and the Law of the Horse,\" in which he argued that the internet did not require thinking about a \"new kind of law.\" Rather, the current legal framework would need to adapt itself to cases in which the internet was involved, using time-honored techniques of comparing facts from old situations to new situations. He recalled University of Chicago Law School dean Gerhard Casper's comment that he was proud that there was no class entitled \"Law of the Horse,\" because such a course would be \"doomed to be shallow and to miss unifying principles.\" \r\n\r\nLawrence Lessig and others disagreed, suggesting that cyberspace was an entirely new thing, that required new regulatory models. Grafting established principles to cyberspace, they suggested, was substantially worse than treating the subject as a <i>tabula rasa</i>. Lessig in particular has championed the creation of new legal frameworks and assumptions that accommodate and regulate actions and transactions in cyberspace.\r\n\r\nSubsequent acts of Congress have leaned closer to Easterbrook than Lessig, creating model acts for electronic transactions that mirror the current regulations underlying all banking and other traditions of transactional law.\r\n\r\nBut Bitcoin might be the technology that broke the horse's back. As a decentralized currency, that can be \"minted\" by anyone with sufficient processing space, and spreads across geographical boundaries in an instant, it is alarming to governments and confounding to the average businessman. But the cool kids seem to like it - its adoption is becoming increasingly widespread. \r\n\r\nIn this talk I'll hit the high points of the law and then address what Bitcoin might mean for the future of transactional law.\r\n",  "start_time": "2013-06-19T16:45:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-19T17:30:00-07:00",    "event_title": "The \"Oh Shit\" Graph: What We Can Learn From Wikipedia's Editor Decline Trend",
      "speaker_ids": [1050], "event_id": 1061,   "track_id": 27,      "description": "Wikipedia and the other Wikimedia projects have been hemorrhaging editors for the past five years.  If this trend of editor decline continues, the projects will die - there will be no one to tend to them.  \r\n\r\nThese type of declines are common in open source projects and, while largely cultural in nature, are often aided and abetted by software.\r\n\r\nWe're going to talk about what is happening and why it happens.  Then we'll talk about ways to recognize and fix it, and what you can do to help - with Wikipedia and in your own projects.\r\n",  "start_time": "2013-06-19T16:45:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-19T17:30:00-07:00",    "event_title": "No, I Won't Contribute to Your Open Source Project",
      "speaker_ids": [1020], "event_id": 957,  "track_id": 29,      "description": "The growth of the open community is inspiring. Every year more governments mandate the use of open standards. New peer reviewed journals promise free access to publicly funded research. Thousands of companies release new software projects to the open source environment.\r\n\r\nYet despite this, most projects find it remarkably difficult to get people to contribute.\r\n\r\nWhy?\r\n\r\nThis session will be a data-driven led discussion aimed toward exposing problems people have with contributing to open source projects and strategies for improving the situation.",  "start_time": "2013-06-19T16:45:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-19T17:30:00-07:00",   "event_title": "Quantitative community management",
      "speaker_ids": [810], "event_id": 1064,  "track_id": 29,      "description": "In recent years, communities as wide-ranging as Wikihow to Thunderbird have been surveying participants and using this information to improve the experiences of participants. A variety of open source projects are now tracking contributors to identify where people fall away, and to nudge them forward. In this talk, you will learn the state of the art in community measurement, common mistakes made in surveying, and how to actively use data to improve activity within a project.\r\n\r\nThis talk will cover the following issues in detail:\r\n\r\n* How Wikipedia used A/B testing to improve contribution rejection messages\r\n* Based on entrance/exit surveys from OpenHatch's Open Source Comes to Campus program, what do new contributors know?\r\n* The impact of treating gender as a plain-text field, rather than a drop-down, on the answer rate\r\n* How Ubuntu's Developer Advisory Team tracks, contacts, and nudges new contributors\r\n* How motivations for Thunderbird contributors differ substantially from the FLOSSpols survey\r\n* How to misread your survey data (and tips on avoiding that)\r\n\r\nUpon leaving this talk, you will have a solid background in the current state of data collection within open source communities and how to apply those tools to your own project.",  "start_time": "2013-06-19T16:45:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-19T17:30:00-07:00",   "event_title": "Low-Friction Personal Data Collection",
      "speaker_ids": [548], "event_id": 1088,  "track_id": 28,      "description": "It's no secret that I like to collect as much personal data as possible. I've been \"tracking my location\":http://infosthetics.com/archives/2012/03/everywhere_ive_been_mapping_3_years_worth_of_location_tracking.html since 2008, tracking my sleep and weight since 2011, and have kept exact \"mileage logs\":http://aaronparecki.com/gas-mileage every time I filled my car with gas.\r\n\r\nYou may think I have some crazy obsession with collecting this much data and will do anything it takes, but in reality I'm pretty lazy about it and look for low-friction solutions otherwise I can't sustain the project.\r\n\r\nIn this talk I'll go over the tools I use for data collection and what I've learned from trying to collect this much data over an extended period of time. I'll highlight some of the new tools coming out soon that I'm hoping will be successful. I will also show visualizations I've made from the data I've collected over time.\r\n",  "start_time": "2013-06-19T16:45:00-07:00",   "presenter": null}, {"room_title": "Hacker Lounge",
      "end_time": "2013-06-19T22:00:00-07:00",   "event_title": "Hacker Lounge Open",
      "event_id": 112, "description": "", "start_time": "2013-06-19T17:30:00-07:00"}, {"room_title": "Fuller Hall",
      "end_time": "2013-06-19T18:30:00-07:00",    "event_title": "Smart Asana",
      "speaker_ids": [599], "event_id": 1149,  "track_id": 29,      "description": "In technology the body is often thought of as merely a vehicle for the brain. We tend to be so intensely focused upon the tasks of the brain that the body is often ignored until problems such as carpal tunnel, neck, shoulder and back pain arise. When the thinking and physical “bodies” are integrated we find that the system as a whole is more efficient. Hatha Yoga provides a path to help not only the mind and body function fluidly together, but it is also a means to care for the whole body before problems arise.\r\n\r\nYoga does not require complicated props or a special place to practice it. Breathing and physical postures can be done anytime, anywhere. Postures and breath practice do not require that anyone be able to bend into complicated positions or hold their breath for a long time. Practice can be simple, easy and restorative and a short practice, even at a desk between phone calls, may bring lasting benefits.",  "start_time": "2013-06-19T17:45:00-07:00",   "presenter": null}, {"room_title": "Hacker Lounge",
      "end_time": "2013-06-19T19:00:00-07:00",   "event_title": "Mozilla Firefox OS (Firefox Phone) ",
      "event_id": 126, "description": "Join Mozilla Reps on Wednesday to learn, hack and celebrate Firefox OS, Mozilla's open source operating system for the mobile web. If you're a web developer, you’ll be right at home coding apps in HTML5, JavaScript and CSS for Firefox OS. We’ll help you with everything else, including how to access mobile Web APIs and how to use the Firefox OS Simulator in your desktop browser to view and test your mobile apps. We'll also have up-to-date Firefox OS handsets around to check out the OS and test your apps and food to satisfy your hunger.\r\n\r\nMozilla Reps Event: https://reps.mozilla.org/e/firefox-os-app-hacking-at-open-source-bridge/\r\n\r\nMore information on Firefox OS: https://developer.mozilla.org/en-US/docs/Mozilla/Firefox_OS ", "start_time": "2013-06-19T18:00:00-07:00"}, {"room_title": "Hacker Lounge",
      "end_time": "2013-06-19T20:00:00-07:00",   "event_title": "Growstuff",
      "event_id": 127, "description": "Growstuff (http://growstuff.org/) is a community of food gardeners, building an open source platform to track, share, and discuss edible gardens and sustainable lifestyles.\r\n\r\nCome help us hack on our platform -- it's mostly Ruby on Rails, with the potential for frontend work, scripting/toolsmithing/devops, etc. We use pair programming, , so if you want to learn then we're happy to mentor/teach. See more about our development process (agile, pairing, etc) at http://wiki.growstuff.org/ ", "start_time": "2013-06-19T19:00:00-07:00"}, {"room_title": "B201",
      "end_time": "2013-06-19T20:30:00-07:00",    "event_title": "Monthly Open Source GIS Meeting - PDX-OSGEO",
      "speaker_ids": [1472], "event_id": 1172,  "track_id": 31,      "description": "PDX-OSGeo has been around and meeting in one form or another since before February 2009 under various names. Since September 2010, we have been recognized as an Oregon-URISA Special Interest Group (SIG). Since 2010, the local chapter has coordinated a yearly open source unconference with ORURISA and GIS In Action. There are also deep roots with our sister OSGeo Local Chapter, CUGOS. In August, 2012, we became an official OSGeo local chapter by action of the OSGeo August, 2012 board meeting. ",  "start_time": "2013-06-19T19:00:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-19T20:30:00-07:00",    "event_title": "DevOps BOF",
      "speaker_ids": [1282], "event_id": 1171,  "track_id": 31,      "description": "PDXDevOps is a Portland, Oregon user group that explores the glorious intersection of software development and systems operations, and shares practical advice on working effectively in an era of agile infrastructure, server automation and cloud computing. The group welcomes participants interested in any related products, technologies and methodologies. The group has been meeting regularly since August 2010 for presentations, demos and discussions applicable to all skill levels, from newbies and experts. Every month 15-35 people come together to share their knowledge, projects and enthusiasm for devops – join us! ",  "start_time": "2013-06-19T19:00:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-19T20:30:00-07:00",   "event_title": "MongoDB Users",
      "speaker_ids": [1321, 1260], "event_id": 1174,  "track_id": 31,      "description": "Informal meetup for MongoDB users. MongoDB (from \"humongous\") is an open-source document database, and the leading NoSQL database. MongoDB aims to be feature-rich, general purpose, and scalable.\r\n\r\nCome to the BoF to ask questions and share ideas with two programmers from 10gen:\r\n\r\n* A. Jesse Jiryu Davis contributes to the MongoDB Python driver and created Motor, an asynchronous MongoDB Python driver for Tornado.\r\n\r\n* Emily Stolfo contributes to the MongoDB Ruby driver and is adjunct faculty at Columbia University.",  "start_time": "2013-06-19T19:00:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-19T20:30:00-07:00",    "event_title": "PyLadies + OpenHatch: Make your first contribution to OSS!",
      "speaker_ids": [1460, 810], "event_id": 1168,  "track_id": 31,      "description": "Contribute with us! PyLadies PDX and OpenHatch are teaming up to host this drop-in session for those who want to contribute to open source, but don't know how to get started. Learn the basics and get set up with OpenHatch, a web platform for helping open source novices get set up and find \"bite-sized\" bugs to work on. All language persuasions welcome, including documentarians and translators--we'll have plenty of mentors and materials on hand to guide you through the process. Goal is to submit a patch by the end of the night (but you'll at least come away with some nifty command-line skills and a roadmap for contributing in the future!)",  "start_time": "2013-06-19T19:00:00-07:00",   "presenter": null}, {"room_title": "Hacker Lounge",
      "end_time": "2013-06-19T21:00:00-07:00",   "event_title": "Cook's Tour of Electronics ",
      "event_id": 128, "description": "A sprint through electronics from electrons to microprocessors and a little beyond. ", "start_time": "2013-06-19T20:00:00-07:00"}, {"room_title": "B304",
      "end_time": "2013-06-19T22:00:00-07:00",    "event_title": "Geeks and Depression: Blue Hackers BoF",
      "speaker_ids": [484], "event_id": 1170,  "track_id": 31,      "description": "There are three rules for this BoF:\r\n\r\n1. What is said at the BoF stays at the BoF.\r\n2. Do not discuss ways and means.\r\n3. Although you are welcome to share what works for you, do not cure evangalize.",  "start_time": "2013-06-19T20:30:00-07:00",   "presenter": null}, {"room_title": "Sanctuary",
      "end_time": "2013-06-20T09:45:00-07:00",    "event_title": "Morning Keynote: Ashe Dryden",
      "speaker_ids": [1410], "event_id": 1151,  "track_id": 29,      "description": "It's been scientifically proven that more diverse communities and workplaces create better products and the solutions to difficult problems are more complete and diverse themselves. Companies are struggling to find adequate talent. So why do we see so few women, people of color, and LGBTQ people at our events and on the about pages of our websites? Even more curiously, why do 60% of women leave the tech industry within 10 years? Why are fewer women choosing to pursue computer science and related degrees than ever before? Why have stories of active discouragement, dismissal, harassment, or worse become regular news?\r\n\r\nIn this talk we’ll examine the causes behind the lack of diversity in our communities, events, and workplaces. We’ll discuss what we can do as community members, event organizers, and co-workers to not only combat this problem, but to encourage positive change by contributing to an atmosphere of inclusivity.\r\n\r\nObjectives:\r\n* Educate about the lack of diversity and why it is a problem\r\n* Examine what is contributing to both the pipeline issue as well as attrition\r\n* Isolate what is and isn't working\r\n* Inspire direct action by examining our own behavior and learning more about the people around us so we can empathize better\r\n",  "start_time": "2013-06-20T09:00:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-20T10:00:00-07:00",   "event_title": "Coffee Break",
      "event_id": 113, "description": "", "start_time": "2013-06-20T09:45:00-07:00"}, {"room_title": "B202/203",
      "end_time": "2013-06-20T10:45:00-07:00",    "event_title": "The Future of Ruby",
      "speaker_ids": [1380], "event_id": 1098,  "track_id": 29,      "description": "The 20th birthday of Ruby, the programming language, was recently celebrated with the release of MRI (Matz's Ruby Implementation) version 2.0. However, MRI is only one of many Ruby implementations. There are also Rubinius, MagLev, JRuby, IronRuby, and most recently, Topaz.\r\n\r\nWhy are there so many implementations of Ruby? How do they (or don't they) benefit the Ruby community? How do they ensure language compatibility? Is Ruby flourishing or is Ruby in decline? What risks to future Ruby result from multiple implementations? Why should you care?\r\n\r\nWe'll briefly discuss several Ruby implementations and their history for context. Then we will examine cooperation between and evolution of the Ruby language through the multiple implementations. We will also discuss the consistency and unity of Ruby as a programming language and consider issues related to verifying compatibility.",  "start_time": "2013-06-20T10:00:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-20T10:45:00-07:00",    "event_title": "Technology for Development—how open source is changing the developing world, and how the movement can do more",
      "speaker_ids": [1501], "event_id": 1175,  "track_id": 29,      "description": "Open source software has been a key enabler of dramatic change in low-income countries and emerging markets. Yet the movement remains primarily focused on the needs of Western developers. \r\n\r\nThis talk will describe some of the more exciting open source projects in the field of international development and how the open source movement can become more global and better support developers, governments, and humanitarians in the developing world.",  "start_time": "2013-06-20T10:00:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T10:45:00-07:00",    "event_title": "Sharing Beyond \"Sharing\": Fostering an Open Sharing Culture in the Philippines",
      "speaker_ids": [1252], "event_id": 939,  "track_id": 29,      "description": "It isn't surprising that Filipinos are a sharing people, whether it be information, food, wealth, etc.  Sharing is encoded into our cultural psyche, has enriched our communities, has brought us together in times of crisis, and has even toppled a president or two in bloodless revolutions.  But is it something that can go beyond just merely sharing things with your friends, and can transcend something larger: in this case, the open source movement?\r\n\r\nFrom explaining the concept of \"bayanihan\":http://en.wikipedia.org/wiki/Bayanihan from a practical and theoretical (philosophical) point of view, to chronicling the rise of the open source movement in the Philippines, to how social networking had radically changed the way Filipinos view information sharing, and even to how Wikipedia in the Philippines is trying to ride this wave, let's paint a picture of how Filipinos are fostering a new \"sharing\" culture for the Philippines: one that goes beyond ourselves and towards the greater good in a society where sharing is something that is still seen as highly personal.",  "start_time": "2013-06-20T10:00:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-20T11:45:00-07:00",    "event_title": "\"Give me money\" or \"join me in doing this great thing\"? A workshop on asking for donations from individuals",
      "speaker_ids": [1289], "event_id": 1041, "track_id": 26,      "description": "There are two very different circumstances in which we ask individuals for money.  (1) I go out to dinner with a group of friends and forget my wallet.  How embarrassing!  There are only 5 people at the table, and I have to rely on social capital to get one of them to pay my share.  (2) I care passionately about a project or cause.  It adds to much meaning to my life and the world!  Who wants to join me in seeing it succeed?\r\n\r\nIf you feel about fundraising the same way you feel about forgetting your wallet, I'm here to help.  For open source projects, individual donations could be a small but important part of your business plan.  There's not reason to let your fear get in the way of raising extra money to maintain and grow the projects you care about.  In this session, we'll discuss:\r\n\r\n• Why people give money to good causes\r\n• How to find people who want to support your cause or project\r\n• How to plan for a fundraising campaign\r\n• How to tell people what you did with their money\r\n• How to ask them for a second donation\r\n\r\nWhether you want to raise money for your own project or help one you simply think is awesome, this session will have something for you.  Once you have the right perspective (expressed as option 2 above) and learn 3 basic frameworks, you'll know everything there is to know about fundraising.  And then you can get back to changing the world.\r\n\r\nNote: This will be an interactive workshop, come ready to talk.",  "start_time": "2013-06-20T10:00:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-20T11:45:00-07:00", "created_at": "2013-02-18T11:20:13-08:00",   "event_title": "Shall We Play A Game?",
      "speaker_ids": [787], "event_id": 974,   "track_id": 27,      "description": "One of the first things people did with computers was to make them play intellectual skill games&mdash;it was such fun that we never stopped. In this interactive session (to which you must bring a laptop and strong programming skills in a programming language of your choice), we will construct a computer player for a very simple strategy game such as \"Goofspiel\":http://en.wikipedia.org/wiki/Goofspiel,   \"Chomp\":http://en.wikipedia.org/wiki/Chomp or \"Hexapawn\":http://en.wikipedia.org/wiki/Hexapawn.\r\n\r\nIn just 1.5 hours, I will help you craft a computer game AI that will consistently beat you and your friends. In the process, you will learn about how computers play games, including some tools you can use to build AIs for more complicated games.",  "start_time": "2013-06-20T10:00:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-20T11:45:00-07:00",    "event_title": "Balloon & Kite Mapping Workshop",
      "speaker_ids": [1387], "event_id": 1104,  "track_id": 30,      "description": "From site evaluation to map stitching, we'll do a crash course in aerial imaging on the cheap.  Head out of doors to fly balloons or kites (depends on the wind), then head back in and sort and stitch a map on Mapknitter.org.  Along the way we'll touch on open hardware and software in community process and why rubber bands are better than code.",  "start_time": "2013-06-20T10:00:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T11:45:00-07:00",    "event_title": "Citizenship Online: Open Source Politics",
      "speaker_ids": [1401], "event_id": 1140,  "track_id": 29,      "description": "Online deliberation applications are commenting systems optimized to help people make decisions with their community's input. This session will discuss the standards established by the ODDI (Online Dialogue and Deliberation Infrastructure workgroup), the Deliberative Feature Set, and how to fit the functions of the application to the decision and the community. \r\n\r\nWe will look at examples of various kinds of deliberative applications from Exploratory deliberations like Amazon reviews (where you look to see what everyone else thinks about that book), to Parliamentary Procedures online (Eliberate). We'll also examine the challenges of developing Civitas, an augmented reality game designed for offline political collaborative action. We'll talk about the role of online deliberation in the electronic democracy and direct democracy movements with examples. You can see the links at http://bit.ly/15p4TlJ",  "start_time": "2013-06-20T11:00:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-20T11:45:00-07:00",    "event_title": "Mod your Android",
      "speaker_ids": [194], "event_id": 1067,  "track_id": 28,      "description": "We will start with a presentation on how a phone or a tablet goes from powering on to loading a kernel to booting into the Android operating system.  A phone is really just a small computer - so if you have experience installing Linux you may find that some of this is familiar territory.  But there are substantial differences too, which we will be talking about.\r\n\r\nTopics that will be covered include unlocking versus rooting a device; the differences between fastboot and recovery modes; the partition schemes commonly used on android devices; how to work with encrypted partitions; plus some device-specific features like APX mode.\r\n\r\nNext we will break out the devices and do some hacking.  If you have thought about modding your own gadget but did not know exactly how to get started, this could be a good chance to get into mobile device hacking.\r\n\r\nI know that installing custom software on a mobile device is complicated and can be scary.  I think that we can help each other through the hurdles.\r\n\r\nI plan to install CyanogenMod on my Nexus S during this session.  I encourage you to bring your device too.  If you do want to bring your own device it would be helpful if you could do some research in advance to find out what ROM (operating system image) you want to install and what is required to unlock your phone.  But if you don't know the answers to those questions then that is what this session is for.\r\n\r\nIMPORTANT: Make sure that you have backups of any important data on your device before unlocking, rooting, or installing a new ROM.  On some devices unlocking the bootloader automatically wipes all data.  And sometimes things just go wrong.",  "start_time": "2013-06-20T11:00:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-20T13:30:00-07:00",   "event_title": "Lunch",
      "event_id": 114, "description": "", "start_time": "2013-06-20T12:00:00-07:00"}, {"room_title": "B204",
      "end_time": "2013-06-20T14:15:00-07:00",    "event_title": "Leveling up in DevOps: the Art of Bad Shell Scripts",
      "speaker_ids": [1406], "event_id": 1139,  "track_id": 29,      "description": "This talk is inspired by an intern that I worked with who was able to go from intern straight to being hired as a senior tier 2 systems engineer. He was something of a freak of nature and it caused me to reflect quite a bit on my own skill set and growth over the years. \r\n\r\nI will cover:\r\n* what I look for in and intern or junior systems engineer when interviewing them\r\n* what I expect from them as a colleague after I am working with them\r\n* what makes the difference in people's growth rate on my team\r\n\r\nI will use as examples:\r\n* methodologies to problem solving on the job\r\n* code contributions to other teams\r\n* styles of shell scripting\r\n* choices of tools to get the job done\r\n\r\nThe take home message will likely be that: I really like to write bad shell scripts ('Bash-ql', 'berl', and 'pash'), any day that I get to use sed and awk is a good day, and that I really love working with the people on my team.",  "start_time": "2013-06-20T13:30:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T14:15:00-07:00",    "event_title": "Wikipedia's new editing system, and how you can use it too",
      "speaker_ids": [1087, 1082], "event_id": 1021,   "track_id": 27,      "description": "Wikipedia is “the free encyclopædia that anyone[citation needed] can edit”. We know from research, however, that most people can’t edit, and so we, a team from the Wikimedia Foundation and Wikia, are building a visual editor to bridge the gap. This is particularly challenging because MediaWiki's syntax, wikitext, is a superset of HTML and Wikipedia’s content is so complex.\r\n\r\nIn the two years that we have been working on this project, we have encountered some unique challenges posed by creating an editor for wikitext and deploying it to an enormous corpus of existing articles have led us to push the limits of Web browsers, JavaScript, parsers and our own creativity.\r\n\r\nAt OS Bridge 2013, we will be a few days away from having VisualEditor be the default way people edit all Wikipedias in all languages. It has come a long way since the demonstration version we showed at OS Bridge 2012. It provides a simple way to create and edit articles, from tiny stubs to mature and complex articles, while still allowing experienced editors to use the old wikitext editor if they want to. With an eye to the future, we have also been carefully preparing the way for the later addition of real-time collaborative editing.\r\n\r\nOne of the key objectives of the VisualEditor has been to de-couple the Javascript editor from MediaWiki. We want VisualEditor to be the best possible HTML editor out there, so great that other Web applications want to use it too. To achieve this there are extensive possibilities for plugins to edit new forms of content, and how it can integrate with other platforms.\r\n\r\nTrevor and Roan will talk about and show off the work we've done, the decisions we made and the issues we worry about. We will ask you what you think, how you might use it, and what more we can do to make VisualEditor the best HTML editor on the Web, whilst making editing Wikipedia – and all our wikis – truly open to everyone.",  "start_time": "2013-06-20T13:30:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-20T14:15:00-07:00",   "event_title": "FAIL is Not a Four-Letter Word",
      "speaker_ids": [1020], "event_id": 956,  "track_id": 29,      "description": "Projects fail. Companies crash and burn. Screws fall out all the time; the world is an imperfect place. Just because it happens doesn’t mean we can’t do our best to prevent it or—at the very least—to minimize the damage when it does. As a matter of fact, embracing failure can be one of the best things you do for your organization.\r\n\r\nDuring this session I'll cover:\r\n\r\n* The most common causes for failure\r\n* Suggestions for how to avoid failing\r\n* How to use failure to your advantage",  "start_time": "2013-06-20T13:30:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-20T14:15:00-07:00",    "event_title": "!done - Hacking IRC Bots for Distributed Teams",
      "speaker_ids": [1064, 548], "event_id": 1106,  "track_id": 29,      "description": "When our company was acquired we needed a way to keep our team and remote teams updated on what we was done. Some members were often travelling or in different time zones. We needed a way to see everything that was done each day all in one place, especially as the teams worked on more complex projects. Everyone was using different methods to do this: standups, written reports, emails and meetings. Nothing stuck.\r\n\r\n\"!done reports\" introduce a simple IRC command: !done. Team members say !done and what they just did. These !dones are put into a daily report.  !done becomes a part of everyday at work, not a strained task that’s easily forgotten. \r\n\r\nMany development teams already use IRC, Skype and other systems to communicate. !done is an addition to existing systems, is open source and easily modified. It is built off of ZenIRC bot and bundled into Loqi, the friendly IRC bot lurking in the #pdxtech channel on freenode. This presentation will show you how a simple bot solved a lot of problems for a lot of distributed people. \r\n",  "start_time": "2013-06-20T13:30:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-20T14:15:00-07:00",    "event_title": "Conducting Your Open Source Project",
      "speaker_ids": [240], "event_id": 1142, "track_id": 26,      "description": "Have you ever wanted to inject more energy into your project team?\r\n\r\nHave you ever needed to reach a hard deadline and felt your resolve quailing?\r\n\r\nHave you ever had to deal with a disgruntled (but important) team member?\r\n\r\nHave you ever tried to revive a dead (or only mostly-dead) project?\r\n\r\nThese are all common scenarios for open source projects; they are also situations often seen in community performing arts organizations. In this session, we will cover leadership strategies and insights gained from organizing, managing, and conducting volunteers in the arts. We will cover how to coordinate and lead in both top-down and self-governing organizations and what open source project management can learn from arts management (and vice versa).",  "start_time": "2013-06-20T13:30:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-20T14:15:00-07:00",   "event_title": "Programming Is Debugging, So Debug Better",
      "speaker_ids": [1404], "event_id": 1156,  "track_id": 28,      "description": "Have you ever:\r\n* Spent hours staring at the same block of code, trying to work out where the bug was, only to realise that it's actually somewhere else?\r\n* Littered your code with print statements, trying to locate a bug, then deleted them all, then put them back in for another bug later?\r\n* Checked in those print statements accidentally?\r\n* Been told that IDEs are for wimps, but secretly wondered what the attraction is?\r\n* Looked at your language's debugging tools, wistfully thought about memorising the obscure commands they need, then gone back to print statements?\r\n* Wondered if all the debugging means that you're not a good coder after all?\r\n\r\nStop wondering. All code has bugs, and all coders fall victim to them. You can't predict what kind of bugs you'll get, but you can arm yourself against their mischief. Even better, with the right coding strategies in mind, you can avoid many of them entirely.\r\n\r\nWe'll be looking at:\r\n* Why bugs happen, even to the best of us\r\n* Software engineering strategies for preventing and containing bug damage\r\n* How to dive into the unknown when diagnosing problems\r\n* Modern heresies that'll make you more productive\r\n* What to look for when choosing languages and frameworks\r\n* The many tools you can use that'll turn debugging time into pony-riding time\r\n* Whether and how to write your own debugging tools, and the nifty things you can do\r\n* Maybe a little more about ponies\r\n\r\nThe languages I'll be targetting with my custom tools are Ruby and Javascript, but the techniques apply to all languages.\r\n\r\nYou can code amazing things. Don't let the bugs drag you down!",  "start_time": "2013-06-20T13:30:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-20T15:15:00-07:00",    "event_title": "Failure and Wikipedia: how encyclopedias work",
      "speaker_ids": [1242], "event_id": 934,  "track_id": 29,      "description": "I want to talk about instances of queering the encyclopedia as an object. With the help of my experiences with Wikipedia communities (in Indian languages and with GLAM activities), I've faced several challenges with documenting oral traditions, different ways of ordering information, getting past accessibility barriers as well as certain prerequisites of knowledge building on Wikipedia through community rules that make sure certain kinds of knowledge-s fail and certain succeed in order to establish why some information is legitimate and some is not which in turn gives crowdsourced information authenticity. ",  "start_time": "2013-06-20T14:30:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-20T15:15:00-07:00",    "event_title": "The problem with passwords on the web and what to do about it",
      "speaker_ids": [1294], "event_id": 977,   "track_id": 27,      "description": "Users hate picking and having to remember them. Developers hate dealing and storing them. Why are we still using passwords again? Surely there is a better way to log into websites.\r\n\r\nThis talk will take a detailed look at the technology behind \"Persona\":https://login.persona.org/about and the \"BrowserID protocol\":https://github.com/mozilla/event_id-specs/blob/prod/browserid/index.md. Mozilla intends to solve the password problem on the web with a federated cross-browser system that is intensely focused on user experience and privacy.\r\n\r\nWe may not be able to get rid of all passwords, after all, you probably don't want to be subjected to a fingerprint check before leaving a comment on someone's blog, but we can eliminate site-specific passwords and replace them with something better: a decentralized system that's under the control of its users, not a for-profit gatekeeper.\r\n\r\nAttendees should come out of this talk with a high-level understanding of the client-side crypto behind the BrowserID standard as well as the \"four simple steps\":https://developer.mozilla.org/en-US/docs/Persona/Quick_Setup required to add support for Persona on their sites.",  "start_time": "2013-06-20T14:30:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-20T15:15:00-07:00",    "event_title": "DIY: Creativity and Open Source",
      "speaker_ids": [1253, 51, 1117, 1004], "event_id": 1155,  "track_id": 29,      "description": "This presentation will explore creative ways panelists have used open source tools. It will focus on art, design, and hardware hacks, with project examples and descriptions of the processes used.\r\nPanelists tentatively confirmed: Sarah Sharp, Cameron Adamez, and Cloë Latchkey.",  "start_time": "2013-06-20T14:30:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T15:15:00-07:00",   "event_title": "Come Make a Map: Completely Custom, Open Source Maps with TileMill",
      "speaker_ids": [295], "event_id": 1121,  "track_id": 28,      "description": "Using the free, open source design studio TileMill, we'll walk through what actually goes into making a map -- from found sources of data to creating your own. Then, we'll style them using CartoCSS, a CSS-like language for instantly styling map data. We'll talk about design issues that go into making good maps. And lastly, we'll talk about how to take your map and do whatever you like with it, whether it's putting it on the web, into a mobile app, or sharing the data with others. You can even follow along on your laptop and end up with your own map! ",  "start_time": "2013-06-20T14:30:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-20T15:15:00-07:00",    "event_title": "Let The Internet Work For You",
      "speaker_ids": [1284], "event_id": 984,  "track_id": 28,      "description": "=Introduction=\r\n\r\nOpen source projects live off the fact that developers turn into contributors and invest their precious time into creating patches, bug fixes and or enhanced functionality for an Open Source code base.\r\n\r\nAs a maintainer of an Open Source project there's significant effort involved in correctly handling these contributions. Reviewing patches from contributors, ensuring the patches completeness (coding style issues and test coverage) are equally as important as running the patched code against the test suite before it’s acceptance. Nobody wants to destabilize the usability of the code base or jeopardize the projects success or momentum, right?!\r\n\r\n=Let The Internet Work For You!=\r\n\r\nWe all love Github for their free code hosting and streamlined collaboration experience. Let's introduce two more players to the table to complete the stack:\r\n\r\nTravis, the Continuous Integration Service\r\nSauce Labs, Selenium Cloud Service\r\n\r\nGithub hosts a lot of the Open Source code which is crucial to the productivity of a Web Developer, however there is a lot more than hosting needed (test execution, static analysis, linting etc) to ensure the hosted code's quality. Travis CI is our friend. The guys at Travis provide a continuous integration service for the open source community free of charge to handle exactly this. In addition to the awesome integration with Github,  it'll check out the latest code and let us perform any given task we can think of, eg. kicking off a test runner for our unit tests or performing static analysis across the code base.\r\n\r\nTo keep up with outside contributions to one’s open source project -- it’s quite helpful to have a continuous build not just for the stable trunk of the project but also for contributing pull requests. Travis and Github came up with a nice solution to this problem -- they kick off builds in Travis-CI whenever a pull request was created and will make information about the build status available through the pull request management user interface.\r\n\r\nSauce Labs has a free service offering for Open Source developers, too. We’ll be using their Selenium Cloud to run QUnit Javascript browser test suites against various browser and platform combinations.\r\n\r\n=Let’s Connect The Dots=\r\n\r\nWe’ll be using a Github hosted example project to illustrate end-to-end integrated test execution. In order to make all these free services work together we’ll need to write a thin layer of code to glue them all together. Enter node.js and grunt.js: Grunt.js is to node.js what GNU Make is to GCC. It’ll let you perform repetitive tasks in an elegant way, using a set of common and or hand-crafted build tasks.\r\n\r\nI’ll show how we can leverage grunt.js tasks to make Travis-CI connect to Sauce Labs through an encrypted secure tunnel, launch a web server to serve the web pages that contain QUnit test suites and execute the javascript tests against a number of platform/browser combinations. Of course all the status information will be conveniently communicated across all the services.\r\n\r\nEver since javascript browser test execution has become such a common use case the sequence of steps required to accomplish aforementioned steps have already been implemented as a grunt.js task. I’ll show how to leverage this for any Github hosted project. \r\n\r\n=How Does This Benefit Me As A Maintainer?=\r\n\r\nI’ll show how Github, Travis-CI and Sauce Labs, can integrate build success / failure reporting into the collaboration workflow on Github to notify maintainers ahead of time about problems which may have gotten introduced with a code contribution.\r\n\r\nThe beauty of this end-to-end test integration is that it will not only run whenever new code was committed, but also branches that have been submitted for merge to master through a pull request. No need for the project maintainer to check out code to their local machines and run tests repeatedly. By the time maintainers review pull requests they will already able to see whether the branch submitted for merge, met style and syntax, and if there were any problems running the javascript browser test suite. ",  "start_time": "2013-06-20T14:30:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-20T15:15:00-07:00",    "event_title": "More Code, More Problems",
      "speaker_ids": [108], "event_id": 950,  "track_id": 28,      "description": "Some people will tell you that you need a large, full-stack framework to do web development The Right Way. These people are wrong.\r\n\r\nA year ago I wrote The MicroPHP Manifesto, a response to the increasing complexity and interdependence of PHP frameworks. The four principles were:\r\n\r\n1. I am a PHP developer\r\n2. I like building small things\r\n3. I want less code, not more\r\n4. I like simple, readable code\r\n\r\nThe thing is, this stuff really isn't specific to PHP. In this talk I'll extend the concepts to other languages we work with in web development, establishing these core principles:\r\n\r\n- Learn languages, not frameworks\r\n- Build small things\r\n- Less code is better than more\r\n- Create and use simple, readable code\r\n\r\nWe'll cover how following these principles makes you a better developer, and makes the job of maintaining and verifying your code much easier.",  "start_time": "2013-06-20T14:30:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-20T15:45:00-07:00",   "event_title": "Afternoon Tea",
      "event_id": 115, "description": "", "start_time": "2013-06-20T15:15:00-07:00"}, {"room_title": "B301",
      "end_time": "2013-06-20T16:30:00-07:00",    "event_title": "Designgineering",
      "speaker_ids": [1087], "event_id": 940,  "track_id": 29,      "description": "What would the world be like if engineers and designers learned each other’s craft? The tense and unproductive relationship between them, especially in the open source community, has surely taken it’s toll on the quality of our projects. The trouble is that we simply know far too little about each other. By learning each other’s craft, we can gain appreciation for each other’s roles, increase our shared vocabulary to improve communication and improve the quality of our software by considering use cases and technical challenges simultaneously.\r\n\r\nWhen someone chooses to use open source, they should be given our respect and appreciation. Sadly we often fall short because our projects are simply not user friendly. We must first gain respect and appreciation for what it takes to meet their needs, and for the people who can help us achieve this. As we work together between disciplines, communication is critical and shared vocabulary is a bottleneck. But by increasing our understanding of each other’s roles we can collaborate with greater ease and achieve superior results. Even if you are working alone, having a broader view of the problem will inform the decisions you make.\r\n\r\nIt’s time we dispensed with stereotypes and self-imposed limitations. It’s time we put to rest years of bad advice about how engineers and designers should deal with each other. Let’s create common ground, and put our projects on sure footing.\r\n\r\nIn this session we will talk about this how we got here, what we can do about it, and how to get started learning a new craft today using open source tools and libraries, and how to have fun in the process.",  "start_time": "2013-06-20T15:45:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-20T16:30:00-07:00",    "event_title": "Data journalism",
      "speaker_ids": [1268], "event_id": 953,  "track_id": 29,      "description": "We have a pipeline problem for people with data and programming skills for journalism. There are great organizations and institutions making tremendous headway, but we need an industry-wide solution for educating the next generation of journalists.\r\n\r\nFor Journalism is an effort to equip every student, mid-career journalist, professor and graduate student with the knowledge they need to learn technical skills for doing journalism, particularly for open data and open government initiatives.\r\n\r\nWe're working on a collection of data-centric journalism course materials with open-source code. The big difference between this project and other training materials is that everything will be contextualized to journalism. We will not be building generic social networks. We will be building campaign-finance trackers and visualizers.\r\n\r\nWe want to impact how journalists think about their craft regardless of age or experience.",  "start_time": "2013-06-20T15:45:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-20T16:30:00-07:00",    "event_title": "Human Interfaces for Geeks",
      "speaker_ids": [511], "event_id": 1056,  "track_id": 29,      "description": "\r\n\r\nAs technical professionals we excel at understanding protocols, standards, file-formats, and APIs. Whenever there is a doubt as to the correct way to do things, one merely needs to read the fine manual or source code.\r\n\r\nUnfortunately the reference manual for humans was lost a long time ago, and the source code is poorly documented. We've been struggling with inter-human communication ever since.\r\n\r\nPaul Fenwick will present his findings at reverse-engineering the human communication protocol.\r\n",  "start_time": "2013-06-20T15:45:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T16:30:00-07:00",    "event_title": "We, the people.",
      "speaker_ids": [1409, 1400], "event_id": 1158,  "track_id": 29,      "description": "We shall talk about, how, if we ever intend to call some coding session 'Hackathons' - We are encountered with questions from the participants like - if we would teach them to 'hack' their friend's Facebook Password. \r\n\r\nIt sure is unfortunate. But, does not always really have to be a sad story. We are from India. We contribute to Open Source. We call MediaWiki our community. But, trust us - It was not that easy! It is still not very easy for most of the people over here, and maybe, in many other places. \r\nLet's talk about that! \r\nThe history. The past. The present. The future, how we want to see it. \r\n\r\nWe shall discuss about :\r\n1. The problems - Society.  The coding culture. We shall explain things as they are.\r\n\r\n2. Our Story - We do have stories of how we got into communities and how much we love it! \r\n\r\n3. Suggestions - Well, we may not be very important people to give others suggestions. But we could help. We are seeing people around, who needs to get a little help to get started. They think different. But they do need support and a little more courage. \r\n\r\nWe are by their side!\r\n",  "start_time": "2013-06-20T15:45:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-20T16:30:00-07:00",   "event_title": "PostgreSQL Replication - The Most Exciting Technology on Earth",
      "speaker_ids": [1305], "event_id": 1016,   "track_id": 27,      "description": "Replication is a staple of every database technology. It offers the potential for better availability, more scaling, and more reliability. It also offers the potential for late nights and inaccurate perceptions of reliability. Knowing your options is the best bet for your to choose the right technology, and to always be able to answer “it depends” when someone asks you if, and which, replication solution to implement. This talk strives to answer “it depends” with joy.\r\n\r\nThe purpose of this talk is to explore the different kinds of replication technologies available (streaming\\binary, object-specific, WAL-shipping), and what the pros and cons are of each. Next, I’ll dive a little deeper into the built-in replication technologies available in Postgres 9.x, including what is new to 9.2. Finally, I will touch on Bucardo, PgPool and potentially other popular third-party replication options, to give the audience a clear picture of what is out there, what each one offers, and what the caveats are.",  "start_time": "2013-06-20T15:45:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-20T16:30:00-07:00",    "event_title": "Search-first writing for non-writers",
      "speaker_ids": [1306], "event_id": 991,  "track_id": 28,      "description": "Tags and keywords, in their best form, contain words that never appear in your document or your software. They are the words that people are using to look for information. Ideally, you wouldn't generate these ideas yourself, you would glean them  from users who are looking for things. You would find them in failed searches and google queries and stack overflow questions, and you would realize that although you think of this feature as the \"queuing engine\", the people on the ground appear to call it the \"queue management system\". So when you tag, you would use \"queue management system\" as one of your terms, and tie it to the queuing engine instructions.\r\n\r\nYour tags and folksonomy should also serve to disambiguate conceptual information from instructions. You may know what a webserver is, thankyouverymuch, but need to know how to configure this particular one. The metadata should make it clear which is concept and which is execution.\r\n\r\nAttend this talk if you want a quick thumbnail on how to make the casual documentation you do more useful for searches.",  "start_time": "2013-06-20T15:45:00-07:00",   "presenter": null}, {"room_title": "B304",
      "end_time": "2013-06-20T17:30:00-07:00",    "event_title": "Where \"Small is Beautiful\" meets \"Big Data\"- Empowering Local Communities with Open Hardware ",
      "speaker_ids": [1322], "event_id": 1009,  "track_id": 29,      "description": "  This session will examine a broader definition of the \"Maker\" movement by seeking ways in which the emerging practice of \"Open Hardware\" empowers communities where cultural or geographic barriers might have prevented engagement in the past.  Furthermore we will examine how such an approach may be combined with the civic technology movement to revitalize participatory institutions which might otherwise be endangered or extinct.\r\n    As this discussion arose out of a civic technology campaign in Maine, we use Maine and northern New England as our primary example.  Examples and use cases from other regions are highly encouraged however.",  "start_time": "2013-06-20T16:45:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T17:30:00-07:00",    "event_title": "Hacking the academic experience",
      "speaker_ids": [1260], "event_id": 1083,  "track_id": 29,      "description": "The fundamentals of Computer Science are still incredibly important to cover in university curricula but practice is just as important as theory.  There is currently a significant difference between what university CS departments teach and what professionals do; if these programs hope to prepare students for graduate school as well as for the “real world”, they need to incorporate more emphasis on contributing to and using open source software, tools such as github, and sharing and reading other people’s code.  Many of us professionals thrive on open source software and wouldn’t hesitate to copy-and-paste a snippet from StackOverflow, but academia isn't teaching this type of resourcefulness to students.\r\n\r\nThis presentation will review:\r\n- Lessons learned from the experience teaching in my alma mater’s CS program. \r\n- How I developed a hacker-centric curriculum teaching not only the algorithms, but the keys to being a successful developer in the modern open source driven Rails community. \r\n- How we as hackers can fix this ",  "start_time": "2013-06-20T16:45:00-07:00",   "presenter": null}, {"room_title": "B301",
      "end_time": "2013-06-20T17:30:00-07:00",    "event_title": "Quick Cure for the Shame of Untested Software",
      "speaker_ids": [1336], "event_id": 1031,  "track_id": 28,      "description": "Testing software is like going regularly to the dentist: we all know we should do it, as well as brush, floss, and rinse regularly, but it just doesn't happen.  For software testing, the whole endeavor can seem like a second job: writing tests, running test, reviewing test results, etc.  Even though testing is a core part of development methodologies like Agile, it's often treated as a second-class citizen because tests aren't a working product, testing takes extra time, and other such nonstarter reasons.\r\n\r\nDon't believe the misinformation: testing can be quick and easy.  In this talk, I approach testing in a language-agnostic way, focusing more on the \"philosophical underpinnings\" of testing and software development that makes testing easier.  Whatever language you use, if you have untested software that you wish was tested, please join us and learn how to get valuable returns for little effort.\r\n\r\nTopics will include:\r\n\r\n* Starting small, i.e. you don't have to \"boil the ocean\" to test\r\n* Code with testability in mind\r\n* Let test libs, harnesses, and automation do the heavy lifting\r\n",  "start_time": "2013-06-20T16:45:00-07:00",   "presenter": null}, {"room_title": "B204",
      "end_time": "2013-06-20T17:30:00-07:00",    "event_title": "Intel Atom for Makers and the DIY Community",
      "speaker_ids": [527], "event_id": 1012,  "track_id": 28,      "description": "As costs have come down and the power of embedded platforms has increased, the hacker/maker community is playing an increasingly critical role in the creation of disruptive technologies. The \"Next Big Thing\" will likely start out as a hacker project using a commodity embedded hardware platform.\r\n\r\nThis talk will introduce you to the MinnowBoard, an affordable, open source hardware platform powered by an Intel Atom processor. It will also cover the development of an autonomous robotics project powered by Minnow and the Yocto Project embedded Linux platform.\r\n",  "start_time": "2013-06-20T16:45:00-07:00",   "presenter": null}, {"room_title": "B202/203",
      "end_time": "2013-06-20T17:30:00-07:00",    "event_title": "Lessons From X",
      "speaker_ids": [787], "event_id": 965,  "track_id": 29,      "description": "The X Window System has, until recently, been essentially the only open source graphical infrastructure for desktop development. I want to share with you some lessons I've learned from 25 years of participation in perhaps the longest-running end-user-facing Open Source project. With the desktop apparently in decline, it seems like a good time to discuss lessons in open source architecture, governance, evolution and dissemination that can be drawn from X.\r\n\r\nMy talk will begin with a brief history of X. This will be used as a basis for discussing topics including: a model for initiating a large open source project;  the several styles of X governance--what worked and what did not; planning for and executing large step changes in the open source model; getting open source out there.",  "start_time": "2013-06-20T16:45:00-07:00",   "presenter": null}, {"room_title": "B302/303",
      "end_time": "2013-06-20T17:30:00-07:00",    "event_title": "The Care and Feeding of Volunteers: Lessons from Non-Profits and OSS",
      "speaker_ids": [1288], "event_id": 982,  "track_id": 29,      "description": "Working with a team which consists primarily of volunteers can make herding cats look simple and straightforward. Not only do you need to find volunteers, but once you have them, you need to foster, encourage, and motivate them to accomplish not only their goals, but your organization's goals as well. This is difficult to do, but not as impossible as it may sound.\r\n\r\nThe first step is to understand that not every person interested in helping with your project will actually know what they're doing. Most non-profit organizations understand that there's some amount of mentoring required to get even the most talented volunteer ready to actually help. This a step that OSS projects often forget, and it is why recruiting and retaining dedicated volunteers can be so difficult.\r\n\r\nI will discuss ways to create an environment that encourages volunteer participation, direction, and retention, using a variety of methods garnered from my experiences in both OSS and non-profit organizations.",  "start_time": "2013-06-20T16:45:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-20T20:00:00-07:00",   "event_title": "Hacker Lounge Open for General Hacking",
      "event_id": 116, "description": "", "start_time": "2013-06-20T17:30:00-07:00"}, {"room_title": "B202/203",
      "end_time": "2013-06-20T18:30:00-07:00",    "event_title": "Hacking your Meatware: exercises you can do at your desk",
      "speaker_ids": [713], "event_id": 1045,  "track_id": 30,      "description": "Sitting in front of a computer for hours at a time affects your body in many negative ways. Your hips get tight, and your core gets soft. In this session, you will practice some simple stretching and strengthening movements to rebalance your body (so you can hack longer).\r\n\r\nBreathing and hydrating are required for your life to continue. You'll get more out of both if you take these actions consciously and deliberately. You will learn a simple breathing exercise with some stretching built in. Have a drink of water first, though.\r\n\r\nAre there stairs where you work? Go up the stairs at least once each day. Is there a railing? You can do reverse rows on almost any bar. The same creativity and problem-solving skills you use in your work can be applied to your health. We will discuss some things to look for, and ways to engage your co-workers. Make it a game.",  "start_time": "2013-06-20T17:45:00-07:00",   "presenter": null}, {"room_title": "B201",
      "end_time": "2013-06-20T20:00:00-07:00",    "event_title": "Code N Splode / Geek Feminism Meetup",
      "speaker_ids": [5, 614], "event_id": 1177,  "track_id": 31,      "description": "Code N Splode is a Portland-based monthly tech meetup supporting the participation of women in the local tech community. \r\n\r\nWe'd like to meet up with attendees who are regular Code N Splode folks as well as those involved with Women Who Hack, Geek Feminism, Ada Initiative and other gender / diversity-in tech communities.  This is a chance for all of us to meet and chat a bit, then head over to the party together.\r\n\r\n!http://img.viame-cdn.com/photos/c28ed000-ba87-0130-cdc2-22000a9e4898/r600x600.jpg!\r\n\"Intersectional feminism - fuck yeah!\"",  "start_time": "2013-06-20T18:30:00-07:00",   "presenter": null}, {"room_title": null,
      "end_time": "2013-06-20T23:00:00-07:00",   "event_title": "5 Years of Open Source Citizenship Party!",
      "event_id": 117, "description": "At OMSI", "start_time": "2013-06-20T19:00:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T09:45:00-07:00",   "event_title": "Unconference Scheduling",
      "event_id": 118, "description": "", "start_time": "2013-06-21T09:00:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T16:00:00-07:00",   "event_title": "Unconference Day",
      "event_id": 119, "description": "", "start_time": "2013-06-21T09:00:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T11:00:00-07:00",   "event_title": "Unconference Sessions",
      "event_id": 120, "description": "", "start_time": "2013-06-21T10:15:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T12:00:00-07:00",   "event_title": "Unconference Sessions",
      "event_id": 121, "description": "", "start_time": "2013-06-21T11:15:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T13:30:00-07:00",   "event_title": "Lunch - Food Cart Field Trip",
      "event_id": 122, "description": "", "start_time": "2013-06-21T12:00:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T14:15:00-07:00",   "event_title": "Unconference Sessions",
      "event_id": 123, "description": "", "start_time": "2013-06-21T13:30:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T15:15:00-07:00",   "event_title": "Unconference Sessions",
      "event_id": 124, "description": "", "start_time": "2013-06-21T14:30:00-07:00"}, {"room_title": null,
      "end_time": "2013-06-21T16:00:00-07:00",   "event_title": "Conference Wrap-up & Feedback",
      "event_id": 125, "description": "", "start_time": "2013-06-21T15:30:00-07:00"}], "is_admin": false}